<?php
	/*
	    How to play
	*/
	$lang['htp_text']			= "متن شیوه ی بازی";
	
	/*
	    Policy
	*/
	$lang['policy_text']		= "
<span class='text_title'>مفاد و شرايط استفاده از اين سايت</span>
<BR /><BR />
اين پايگاه اينترنتى توسط رنو پارس تأسيس گرديده است تا بازديد کننده از آخرين محصولات و خدمات ما مطلع گردد اميدواريم که بازديد مفيد و ثمر بخشى را داشته باشيد. دسترسى و استفاده از اين سايت مشروط به موافقت بازديد کننده با مفاد و شرايط ذيل و همچنين کليه قوانين و مقررات مربوطه مى باشد. اين مفاد و شرايط جايگزين هرگونه توافق هاى پيشين ميان رنو پارس و بازديد کنندگان در خصوص استفاده از اين پايگاه اينترنتى مى باشد. بازديد کننده تأئيد و موافقت مى نمايد که رنو پارس هيچگونه مسئوليتى را در قبال زيان ها و يا خساراتى که از عدم رعايت وظايف ذيل ناشى گردند، بعهده ندارد.
<BR /><BR />
<span class='text_title'>حقوق مالکيت معنوى</span>
<BR /><BR />
کليه حقوق مالکيت اين پايگاه اينترنتى شامل تصاوير، صوت ها، متون، فيلم ها و يا هر جزء ديگرى از آن، در مالکيت رنو پارس قرار دارد و کليه حقوق اين مالکيت اکيداً محفوظ مى باشند. انجام هرگونه کپى، استخراج و يا تکثير بخشى و يا تمامى اطلاعات و يا ساير اجزاء اين پايگاه اينترنتى اکيداً ممنوع مى باشد. انجام هرگونه دستبرد و يا هرگونه عمل ديگرى که حقوق رنو پارس را خدشه دار نمايد نيز ممنوع است. کپى رايت رنو پارس
<BR /><BR />
<span class='text_title'>لينک اينترنتى</span>
<BR /><BR />
برقرارى لينک اينترنتى به سوى اين سايت ملزم به کسب مجوز رسمى رنو پارس مى باشد. در صورت تمايل بازديد کننده به برقرارى يک لينک اينترنتى به اين سايت، قبل از انجام آن با مدير بازاريابى رنو پارس مى بايست تماس حاصل گردد.


<BR /><BR />
<span class='text_title'>مسئوليت محدود</span>
<BR /><BR />
بازديد از اين پايگاه اينترنتى و همچنين تبعات و عواقب آن با مسئوليت تام بازديد کننده انجام مى پذيرد. در هيچ شرايطى و به هيچ عنوان رنو پارس مسئوليتى را در قبال خسارات مستقيم و يا غير مستقيم و يا هرگونه زيانى از جمله از دست دادن داده ها، نرم افزار ها و زيان هاى مالى که در نتيجه بازديد و يا وصل گرديدن به اين سايت و يا هر سايت مرتبط به اين پايگاه ناشى گردد را بعهده ندارد و نمى پذيرد.
<BR /><BR />
اطلاعات ارائه شده در مورد مدل خودرو ها و خصوصيات هريک از آنها، تنها در تاريخ قرار گرفتن اطلاعات در اين پايگاه و يا به روز نمودن آنها، مستند مى باشد. اين اطلاعات جهت راهنمائى بازديد کننده ارائه گرديده اند و به هيچ عنوان در مقام يک پيشنهاد قراردادى در قالب عرضه محصولات و خدمات رنو پارس نمى توانند تلقى گردند. اشتباهات و يا مطالب از ياد رفته در ارتباط با اين اطلاعات قابل وقوع مى باشند.
<BR /><BR />
دسترسى به محصولات و خدمات ارائه شده در اين پايگاه با محدوديت هائى مواجه مى توانند باشند. نتيجتاً، بازديد کننده مى بايست اطمينان حاصل نمايد که قوانين رايج در کشورى که مبدأ آن به اين پايگاه مرتبط شده است، اجازه بازديد و استفاده از اين پايگاه اينترنتى را به وى مى دهد.
<BR /><BR />
<span class='text_title'>به روز نمودن مفاد و شرايط</span>
<BR /><BR />
رنو پارس حق خود را محفوظ مى داند تا دسترسى به اين پايگاه و مفاد و شرايط ذکر شده را در هر زمان تغيير داده يا به روز نمايد. بازديد کننده نيز متعهد و موافق مى باشد تا خود را با اين تغييرات منطبق نمايد. لذا، لازم است که بازديد کنندگان به طور منظم به صفحات 'اطلاعات حقوقى' پايگاه رجوع نمايند تا از آخرين مفاد و شرايط استفاده از اين سايت مطلع گردند.<BR /><BR />
	";