<?php
	/*
	    Prize
	*/
	$lang['htp_text']			= "
	<BR />
	<span class='text_title'>رالی بزرگ رنو با جوایزی هیجان انگیز</span>&nbsp;&nbsp;<B>(Nokia N97 mini و 10 اعتبارنامه مسیریابی)</B>
	<BR /><BR /><BR />
<B>چه جوری می تونم توی قرعه کشی شرکت کنم؟</B><BR />
برای شرکت در قرعه کشی فقط کافیه توی رالی های رنو شرکت کنی و تا می تونی امتیاز بگیری. هر چی امتیاز بیشتر بگیری شانست برای برنده شدن بیشتر می شه.
<BR /><BR />
<B>چه جوری شانسم رو برای برنده شدن زیاد کنم؟</B><BR />
برای این که شانست برای برنده شدن زیاد شه، لازمه که مرتب به رنوت سر بزنی و برای شرکت تو رالی های مختلف بهش برسی. اگر رالی رنو رو به دوستات معرفی کنی و باعث شی که اونا هم عضو بشن، شانست بیشتر می شه.
<BR /><BR />
<B>چه قانونایی برای شرکت توی قرعه کشی هست؟</B><BR />
اول اینکه باید توی سایت عضو بشی و توی رالی های رنو شرکت کنی.
<BR />
دوم اینکه جایزه ها فقط برای اونایی هست که توی ایران زندگی می کنن.
<BR />
سوم اینکه افراد برنده از طریق تلفن باخبر می شن و فقط 7 روز فرصت دارن تا جایزه شون رو بگیرن. پس بهتره که اطلاعات تماس خودت رو کامل و صحیح وارد کنی.
<BR /><BR />
<B>زمان قرعه کشی کی هست؟</B><BR />
قرعه کشی 30 بهمن برگزار می شه. رنوت ردیفه؟
";