-- phpMyAdmin SQL Dump
-- version 3.2.2.1deb1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Jul 03, 2010 at 04:44 PM
-- Server version: 5.1.37
-- PHP Version: 5.2.10-2ubuntu6.4

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `yammy`
--
CREATE DATABASE `yammy` DEFAULT CHARACTER SET utf8 COLLATE utf8_persian_ci;
USE `yammy`;

-- --------------------------------------------------------

--
-- Table structure for table `abuse`
--

CREATE TABLE IF NOT EXISTS `abuse` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(10) unsigned NOT NULL,
  `type` tinyint(4) NOT NULL COMMENT '1:badNaming;2:badMessage;3:others',
  `sender` int(10) unsigned NOT NULL,
  `date` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=7 ;

--
-- Dumping data for table `abuse`
--

INSERT INTO `abuse` (`id`, `user_id`, `type`, `sender`, `date`) VALUES
(1, 2, 0, 6, '2010-04-25 15:48:17'),
(2, 28, 0, 6, '2010-05-01 10:53:50'),
(3, 2, 1, 1, '2010-05-05 11:36:29'),
(4, 2, 2, 1, '2010-05-05 11:36:35'),
(5, 2, 3, 1, '2010-05-05 11:36:40'),
(6, 1, 1, 33, '2010-06-09 14:16:27');

-- --------------------------------------------------------

--
-- Table structure for table `accessories`
--

CREATE TABLE IF NOT EXISTS `accessories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL,
  `description` text CHARACTER SET ucs2 COLLATE ucs2_persian_ci NOT NULL,
  `type` tinyint(4) NOT NULL COMMENT '0:not defined,1:offensive,2:defensive,3:help,4:other',
  `group` tinyint(4) NOT NULL DEFAULT '0',
  `price` int(11) NOT NULL,
  `level` tinyint(4) NOT NULL DEFAULT '0',
  `sell_cost` int(11) NOT NULL,
  `effect` int(11) NOT NULL,
  `life_time` int(11) NOT NULL COMMENT 'with hour unit(for offensive acc is time to effect in target-in defensive object life time of acc)',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=46 ;

--
-- Dumping data for table `accessories`
--

INSERT INTO `accessories` (`id`, `name`, `description`, `type`, `group`, `price`, `level`, `sell_cost`, `effect`, `life_time`) VALUES
(1, 'aphid', 'شته میتونه در یک ساعت ۳۰درصد از سلامت گیاه کم کنه', 1, 1, 20, 3, 0, 30, 1),
(20, 'clipper', 'برای اینکه بتونی لوبیا رو برداشت کنی به قیچی باغبانی نیاز پیدا می کنی', 4, 20, 50, 4, 0, 0, 0),
(2, 'grasshoppers', 'اگه ملخ تو مزرعه ای بندازی میتونه تو ۱ ساعت از سلامت گیاهاش ۵۰٪ کم کنه', 1, 1, 250, 4, 0, 50, 1),
(3, 'sprayer', 'اگه سمپاش بخری مزرعت به صورت اتومات سمپاشی میشه', 2, 1, 500, 4, 0, 0, 0),
(21, 'shovel', 'برای کاشت گوجه فرنگی نیاز به بیلچه خواهی داشت', 4, 20, 100, 5, 0, 0, 0),
(4, 'mouse', 'موش در سه ساعت میتونه ۱۰٪ از کل مزرعه رو بخوره', 1, 2, 400, 5, 0, 60, 3),
(5, 'gun', 'با استفاده از تفنگ میتونی یک سری حملاتو دفع کنی', 2, 2, 300, 5, 0, 0, 0),
(40, 'lamp', 'لامپ اشعه دار باعث میشه رشد گیاهانت ۲۵٪ سریعتر بشه', 4, 10, 500, 6, 0, 25, 0),
(6, 'crow', 'کلاغ میتونه طی ۲ ساعت ۲۰کیلوگرم محصول بخوره', 1, 2, 800, 6, 0, 240, 1),
(7, 'scarecrow', 'اگه واسه مزرعت مترسک بخری باعث میشه ۵۰٪ از اثر حملات کلاغ ها کم بشه', 2, 2, 900, 6, 0, 50, 24),
(8, 'dog', 'سگ باعث میشه ۱۰٪ کمتر محصولاتت توسط حیوونهای مهاجم دزدیده بشه و همینطور با پارس کردن ۵ تا از دوستاتو خبر میکنه', 2, 2, 1000, 7, 0, 10, 72),
(42, 'tractor', 'اگه واسه مزرعت تراکتور بخری شخم زدن مزرعه برات مجانی میشه', 4, 11, 500, 3, 0, 0, 0),
(43, 'stand', 'برای کاشت بادمجان نیاز به پایه ی نگه دارنده ی گیاه خواهی داشت', 4, 20, 300, 8, 0, 0, 0),
(44, 'heater', 'با استفاده از گرمکن میتونی شب ها هم گیاهاتو گرم نگخ داری و رشد گیاهات ۳۰٪ سریعتر بشه', 4, 10, 1000, 9, 0, 30, 0),
(45, 'silo', 'در مرحله ۱۰ بازی برای اینکه بتونی از محصولاتت نگهداری کنی نیاز به خرید سیلو داری', 4, 20, 5000, 10, 0, 0, 0);

-- --------------------------------------------------------

--
-- Table structure for table `farmaccessories`
--

CREATE TABLE IF NOT EXISTS `farmaccessories` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `farm_id` int(11) NOT NULL,
  `accessory_id` int(11) NOT NULL,
  `count` tinyint(4) NOT NULL,
  `create_date` int(11) NOT NULL,
  `modified_date` int(11) NOT NULL,
  `expire_date` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=97 ;

--
-- Dumping data for table `farmaccessories`
--

INSERT INTO `farmaccessories` (`id`, `farm_id`, `accessory_id`, `count`, `create_date`, `modified_date`, `expire_date`) VALUES
(82, 25, 3, 1, 1276660713, 1276660713, 0),
(2, 2, 1, 4, 1268128122, 1268128130, 0),
(3, 1, 20, 1, 1268193386, 1268193386, 0),
(4, 1, 2, 3, 1268195544, 1276664863, 0),
(22, 14, 1, 7, 1270530532, 1270617958, 0),
(6, 2, 2, 10, 1268207279, 1268207541, 0),
(7, 2, 3, 1, 1268207419, 1268207419, 0),
(8, 1, 21, 1, 1268453012, 1268453012, 0),
(9, 1, 4, 8, 1268458789, 1269747157, 0),
(10, 2, 20, 1, 1268469372, 1268469372, 0),
(11, 2, 21, 1, 1268469479, 1268469479, 0),
(12, 2, 5, 7, 1268472837, 1269747170, 0),
(13, 2, 6, 2, 1268550107, 1268630040, 0),
(14, 1, 40, 1, 1268553454, 1268553454, 0),
(15, 1, 5, 10, 1268553736, 1268553751, 0),
(24, 14, 20, 1, 1270617156, 1270617156, 0),
(25, 16, 20, 1, 1270617756, 1270617756, 0),
(26, 16, 3, 1, 1270617935, 1270617935, 0),
(27, 14, 2, 1, 1270623157, 1270623157, 0),
(28, 14, 3, 1, 2010, 2010, 0),
(31, 20, 42, 1, 1272682953, 1272682953, 0),
(32, 1, 43, 1, 1272765301, 1272765301, 0),
(33, 1, 44, 1, 1272767379, 1272767379, 0),
(34, 1, 45, 1, 1272771340, 1272771340, 0),
(69, 23, 42, 1, 1276483472, 1276483472, 0),
(68, 23, 20, 1, 1276483268, 1276483268, 0),
(85, 25, 20, 1, 1276664871, 1276664871, 0),
(66, 23, 40, 1, 1276482475, 1276482475, 0),
(84, 1, 1, 2, 1276664858, 1276664860, 0),
(62, 23, 21, 1, 1276481928, 1276481928, 0),
(60, 23, 4, 4, 1276414913, 1278080293, 0),
(59, 23, 2, 6, 1276414905, 1276584013, 0),
(58, 23, 1, 9, 1276414901, 1276483462, 0),
(57, 23, 45, 1, 1276320264, 1276320264, 0),
(87, 16, 1, 2, 1277169454, 1277169455, 0),
(88, 16, 2, 2, 1277169457, 1277169459, 0),
(89, 16, 4, 2, 1277169463, 1277169464, 0),
(90, 16, 6, 2, 1277169467, 1277169468, 0),
(91, 16, 42, 1, 1277169481, 1277169481, 0),
(93, 16, 43, 1, 1277181775, 1277181775, 0),
(94, 16, 45, 1, 1277255381, 1277255381, 0);

-- --------------------------------------------------------

--
-- Table structure for table `farmmissions`
--

CREATE TABLE IF NOT EXISTS `farmmissions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `farm_id` int(11) NOT NULL,
  `mission_id` smallint(6) NOT NULL,
  `plant_id` int(11) NOT NULL,
  `stack` int(11) NOT NULL DEFAULT '0',
  `status` tinyint(4) NOT NULL COMMENT '0:onWay;1:success;2:faild',
  `create_date` int(11) NOT NULL,
  `modified_date` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=180 ;

--
-- Dumping data for table `farmmissions`
--

INSERT INTO `farmmissions` (`id`, `farm_id`, `mission_id`, `plant_id`, `stack`, `status`, `create_date`, `modified_date`) VALUES
(1, 1, 5, 1, 0, 2, 1268477315, 1268562636),
(2, 2, 4, 2, 0, 1, 1268481974, 1268482053),
(3, 2, 5, 3, 0, 2, 1268482081, 1268552578),
(4, 2, 5, 4, 0, 2, 1268552588, 1268555712),
(5, 2, 5, 5, 0, 1, 1268555872, 1268555894),
(6, 2, 6, 6, 0, 1, 1268562877, 1268563565),
(7, 1, 6, 7, 0, 2, 1268566062, 1268635941),
(8, 1, 7, 8, 0, 2, 1268637808, 1268718092),
(9, 2, 7, 9, 0, 2, 1269677090, 1269756145),
(10, 2, 7, 10, 0, 2, 1269756158, 1269779054),
(15, 12, 2, 15, 0, 2, 1269851173, 1269856549),
(14, 12, 1, 14, 0, 1, 1269850996, 1269851157),
(16, 12, 2, 16, 5, 2, 1269856588, 1277013230),
(17, 1, 2, 17, 0, 2, 1269861814, 1269866648),
(18, 1, 2, 18, 0, 2, 1269937053, 1269942702),
(19, 1, 2, 19, 0, 2, 1269946043, 1269949957),
(21, 1, 2, 21, 0, 2, 1269950269, 1269950542),
(22, 1, 2, 22, 0, 2, 1269950933, 1270017499),
(92, 23, 10, 95, 5, 2, 1276069051, 1276336017),
(93, 25, 1, 96, 4, 2, 1276072175, 1276076213),
(34, 14, 2, 37, 5, 2, 1270374390, 1270533831),
(40, 14, 3, 43, 36, 1, 1270628060, 1270628098),
(41, 14, 4, 44, 16, 2, 1270633360, 1270885400),
(96, 27, 1, 99, 4, 2, 1276088956, 1276089029),
(94, 25, 1, 97, 8, 2, 1276076437, 1276322742),
(97, 25, 1, 100, 12, 2, 1276322986, 1276329071),
(49, 1, 8, 52, 420, 1, 1272782342, 1272782373),
(54, 1, 9, 57, 951, 2, 1272786242, 1272786290),
(53, 1, 9, 56, 391, 2, 1272785647, 1272786222),
(95, 28, 1, 98, 4, 2, 1276086525, 1276323058),
(106, 25, 3, 109, 6, 2, 1276338890, 1276415411),
(101, 27, 7, 104, 0, 0, 1276330204, 1276330204),
(100, 28, 1, 103, 12, 2, 1276329349, 1276333055),
(99, 25, 1, 102, 32, 1, 1276329086, 1276330955),
(98, 28, 1, 101, 8, 2, 1276323115, 1276329276),
(103, 28, 1, 106, 32, 1, 1276333068, 1276335016),
(104, 28, 2, 107, 25, 1, 1276335610, 1276346432),
(105, 23, 10, 108, 9, 2, 1276336471, 1276346367),
(107, 23, 10, 110, 13, 2, 1276346551, 1276407293),
(108, 23, 10, 111, 29, 2, 1276407412, 1276413364),
(109, 25, 3, 112, 12, 2, 1276415436, 1276495769),
(110, 23, 10, 112, 1400, 2, 1276427040, 1276514840),
(111, 25, 3, 114, 18, 2, 1276495779, 1276586454),
(112, 23, 9, 115, 64, 2, 1276515322, 1276515368),
(113, 23, 9, 116, 169, 2, 1276515534, 1276515589),
(114, 23, 9, 117, 309, 2, 1276515764, 1276515782),
(115, 23, 9, 118, 869, 2, 1276516099, 1276516127),
(117, 23, 9, 120, 1429, 1, 1276516304, 1276516320),
(118, 23, 1, 121, 79, 1, 1276516383, 1276516424),
(120, 23, 10, 123, 1424, 2, 1276580882, 1276667019),
(121, 25, 3, 124, 24, 2, 1276586619, 1276670576),
(122, 25, 3, 125, 54, 1, 1276670619, 1276676804),
(123, 23, 10, 126, 1424, 0, 1276673789, 1276673789),
(124, 25, 4, 127, 16, 2, 1276681086, 1276943636),
(125, 25, 4, 128, 32, 2, 1276943656, 1277717452),
(126, 29, 1, 129, 0, 0, 1276943983, 1276943983),
(127, 31, 1, 130, 0, 0, 1277032171, 1277032171),
(128, 32, 1, 131, 0, 0, 1277196320, 1277196320),
(129, 33, 1, 132, 0, 0, 1277197309, 1277197309),
(179, 38, 1, 183, 0, 0, 1278151283, 1278151283),
(178, 38, 1, 182, 0, 2, 1278151086, 1278151270),
(177, 25, 4, 181, 32, 0, 1278142293, 1278142293),
(176, 16, 10, 180, 0, 0, 1278096390, 1278096390),
(171, 35, 1, 175, 16, 2, 1277640801, 1277642619),
(172, 35, 1, 176, 20, 1, 1277642630, 1277703640),
(173, 35, 2, 177, 0, 0, 1277705813, 1277705813),
(174, 36, 1, 178, 0, 2, 1277717879, 1277717979),
(175, 36, 1, 179, 0, 0, 1277717997, 1277717997);

-- --------------------------------------------------------

--
-- Table structure for table `farmresources`
--

CREATE TABLE IF NOT EXISTS `farmresources` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `resource_id` int(11) NOT NULL,
  `farm_id` int(11) NOT NULL,
  `count` tinyint(4) NOT NULL DEFAULT '1',
  `create_date` date NOT NULL,
  `modified_date` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=82 ;

--
-- Dumping data for table `farmresources`
--

INSERT INTO `farmresources` (`id`, `resource_id`, `farm_id`, `count`, `create_date`, `modified_date`) VALUES
(1, 1, 1, 10, '2010-03-06', '2010-03-30'),
(2, 2, 1, 2, '2010-03-06', '2010-03-30'),
(3, 1, 2, 5, '2010-03-07', '2010-03-27'),
(4, 2, 2, 1, '2010-03-07', '2010-03-27'),
(5, 1, 3, 10, '2010-03-29', '2010-03-29'),
(6, 2, 3, 5, '2010-03-29', '2010-03-29'),
(7, 1, 4, 10, '2010-03-29', '2010-03-29'),
(8, 2, 4, 5, '2010-03-29', '2010-03-29'),
(9, 1, 5, 10, '2010-03-29', '2010-03-29'),
(10, 2, 5, 5, '2010-03-29', '2010-03-29'),
(11, 1, 6, 10, '2010-03-29', '2010-03-29'),
(12, 1, 7, 10, '2010-03-29', '2010-03-29'),
(13, 2, 7, 5, '2010-03-29', '2010-03-29'),
(14, 1, 8, 10, '2010-03-29', '2010-03-29'),
(15, 2, 8, 5, '2010-03-29', '2010-03-29'),
(16, 1, 9, 10, '2010-03-29', '2010-03-29'),
(17, 2, 9, 5, '2010-03-29', '2010-03-29'),
(18, 1, 10, 10, '2010-03-29', '2010-03-29'),
(19, 2, 10, 5, '2010-03-29', '2010-03-29'),
(20, 1, 11, 10, '2010-03-29', '2010-03-29'),
(21, 2, 11, 5, '2010-03-29', '2010-03-29'),
(22, 1, 12, 5, '2010-03-29', '2010-03-29'),
(23, 2, 12, 2, '2010-03-29', '2010-03-29'),
(26, 1, 13, 9, '2010-04-03', '2010-04-03'),
(27, 2, 13, 4, '2010-04-03', '2010-04-03'),
(28, 1, 14, 4, '2010-04-03', '2010-06-02'),
(29, 2, 14, 4, '2010-04-03', '2010-06-02'),
(30, 1, 15, 8, '2010-04-03', '2010-04-03'),
(31, 2, 15, 4, '2010-04-03', '2010-04-03'),
(32, 1, 16, 0, '2010-04-03', '2010-07-03'),
(33, 2, 16, 1, '2010-04-03', '2010-06-27'),
(34, 1, 17, 10, '2010-04-27', '2010-04-27'),
(35, 2, 17, 5, '2010-04-27', '2010-04-27'),
(36, 1, 18, 10, '2010-04-27', '2010-04-27'),
(37, 2, 18, 5, '2010-04-27', '2010-04-27'),
(38, 1, 19, 10, '2010-04-27', '2010-04-27'),
(39, 2, 19, 5, '2010-04-27', '2010-04-27'),
(40, 1, 20, 10, '2010-04-27', '2010-04-27'),
(41, 2, 20, 5, '2010-04-27', '2010-04-27'),
(42, 1, 21, 10, '2010-05-02', '2010-05-02'),
(43, 2, 21, 5, '2010-05-02', '2010-05-02'),
(44, 1, 22, 10, '2010-05-02', '2010-05-02'),
(45, 2, 22, 5, '2010-05-02', '2010-05-02'),
(46, 1, 23, 3, '2010-05-08', '2010-07-03'),
(47, 2, 23, 2, '2010-05-08', '2010-07-03'),
(48, 0, 1, 1, '2010-05-11', '2010-05-11'),
(49, 1, 24, 10, '2010-06-02', '2010-06-02'),
(50, 2, 24, 5, '2010-06-02', '2010-06-02'),
(51, 1, 25, 3, '2010-06-08', '2010-07-03'),
(52, 2, 25, 3, '2010-06-08', '2010-07-03'),
(53, 1, 26, 10, '2010-06-09', '2010-06-09'),
(54, 2, 26, 5, '2010-06-09', '2010-06-09'),
(55, 1, 27, 11, '2010-06-09', '2010-06-16'),
(56, 2, 27, 6, '2010-06-09', '2010-06-16'),
(57, 1, 28, 2, '2010-06-09', '2010-06-16'),
(58, 2, 28, 4, '2010-06-09', '2010-06-16'),
(59, 0, 1, 1, '2010-06-15', '2010-06-15'),
(60, 0, 1, 1, '2010-06-15', '2010-06-15'),
(61, 0, 1, 1, '2010-06-15', '2010-06-15'),
(62, 1, 29, 10, '2010-06-16', '2010-06-16'),
(63, 2, 29, 5, '2010-06-16', '2010-06-16'),
(64, 1, 30, 10, '2010-06-20', '2010-06-20'),
(65, 2, 30, 5, '2010-06-20', '2010-06-20'),
(66, 1, 31, 12, '2010-06-20', '2010-06-20'),
(67, 2, 31, 5, '2010-06-20', '2010-06-20'),
(68, 1, 32, 9, '2010-06-22', '2010-06-22'),
(69, 2, 32, 4, '2010-06-22', '2010-06-22'),
(70, 1, 33, 8, '2010-06-22', '2010-06-22'),
(71, 2, 33, 5, '2010-06-22', '2010-06-22'),
(72, 1, 34, 7, '2010-06-27', '2010-06-27'),
(73, 2, 34, 3, '2010-06-27', '2010-06-27'),
(74, 1, 35, 0, '2010-06-27', '2010-06-28'),
(75, 2, 35, 0, '2010-06-27', '2010-06-28'),
(76, 1, 36, 8, '2010-06-28', '2010-06-28'),
(77, 2, 36, 3, '2010-06-28', '2010-06-28'),
(78, 1, 37, 10, '2010-06-28', '2010-06-28'),
(79, 2, 37, 5, '2010-06-28', '2010-06-28'),
(80, 1, 38, 7, '2010-07-03', '2010-07-03'),
(81, 2, 38, 2, '2010-07-03', '2010-07-03');

-- --------------------------------------------------------

--
-- Table structure for table `farms`
--

CREATE TABLE IF NOT EXISTS `farms` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `name` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `money` int(11) NOT NULL DEFAULT '500',
  `section` tinyint(4) NOT NULL DEFAULT '1' COMMENT 'size of farm area',
  `plow` tinyint(1) NOT NULL DEFAULT '0',
  `level` int(11) NOT NULL DEFAULT '1' COMMENT 'level of the user',
  `create_date` date NOT NULL,
  `modified_date` date NOT NULL,
  `disactive` smallint(6) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=39 ;

--
-- Dumping data for table `farms`
--

INSERT INTO `farms` (`id`, `user_id`, `name`, `money`, `section`, `plow`, `level`, `create_date`, `modified_date`, `disactive`) VALUES
(1, 1, 'Farm-1', 825712, 4, 1, 11, '2010-03-06', '2010-06-16', 1),
(2, 2, 'Farm-2', 1500, 2, 1, 7, '2010-03-07', '2010-05-01', 0),
(20, 28, 'جعفر', 3400, 1, 1, 3, '2010-04-27', '2010-05-02', 0),
(16, 7, 'Farm-5', 286601, 4, 1, 10, '2010-04-03', '2010-07-02', 0),
(14, 6, 'Farm-4', 5950, 1, 1, 1, '2010-04-03', '2010-06-22', 0),
(30, 3, 'iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii', 500, 1, 0, 1, '2010-06-20', '2010-06-20', 0),
(23, 31, 'کشمیشی', 372795, 4, 1, 10, '2010-05-08', '2010-07-03', 0),
(24, 32, 'mark', 500, 1, 0, 1, '2010-06-02', '2010-06-02', 0),
(25, 33, 'عمه جان', 8740, 1, 1, 4, '2010-06-08', '2010-07-03', 0),
(26, 51, 'kjhkjh', 500, 1, 0, 1, '2010-06-09', '2010-06-09', 0),
(27, 52, 'yiuyiuy', 980, 3, 1, 7, '2010-06-09', '2010-06-16', 0),
(28, 53, 'دولابچه سرا', 10720, 1, 0, 3, '2010-06-09', '2010-06-28', 0),
(29, 9, 'mark', 200, 1, 1, 1, '2010-06-16', '2010-06-19', 0),
(31, 54, 'مزرعه من', 150, 1, 1, 1, '2010-06-20', '2010-06-20', 0),
(32, 55, 'zzzz', 200, 1, 1, 1, '2010-06-22', '2010-06-22', 0),
(33, 56, 'شلغم کاران', 180, 1, 1, 1, '2010-06-22', '2010-06-22', 0),
(37, 57, 'kjhkkjhkjhkjhk', 500, 1, 0, 1, '2010-06-28', '2010-06-28', 0),
(36, 59, 'احمدآباد مستوفی', 0, 1, 1, 1, '2010-06-28', '2010-06-28', 0),
(38, 60, 'خوراک ساز', 0, 1, 1, 1, '2010-07-03', '2010-07-03', 0);

-- --------------------------------------------------------

--
-- Table structure for table `farmtransactions`
--

CREATE TABLE IF NOT EXISTS `farmtransactions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `offset_farm` int(11) NOT NULL DEFAULT '0',
  `goal_farm` int(11) NOT NULL,
  `accessory_id` int(11) NOT NULL,
  `type` tinyint(4) NOT NULL COMMENT '0:notDefined;1:offensive;2:defensive;3:help;4:other',
  `details` text CHARACTER SET utf8 COLLATE utf8_persian_ci NOT NULL COMMENT 'description and data holder; 1: addResourceToFriendPlant;2x:deffendFreindFarmAgainst(x)accessoryId;3:moneyHelp',
  `flag` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0:onWAy,1:done,2:reject',
  `alert_flag` tinyint(4) NOT NULL DEFAULT '0' COMMENT 'used for dog alert and etc',
  `create_date` int(11) NOT NULL,
  `modified_date` int(11) NOT NULL,
  `efficacy_date` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=16 ;

--
-- Dumping data for table `farmtransactions`
--

INSERT INTO `farmtransactions` (`id`, `offset_farm`, `goal_farm`, `accessory_id`, `type`, `details`, `flag`, `alert_flag`, `create_date`, `modified_date`, `efficacy_date`) VALUES
(13, 25, 23, 0, 3, '3', 0, 0, 1278143303, 1278143303, 0),
(12, 25, 23, 1, 1, '', 2, 0, 1278143029, 1278143318, 1278146629),
(11, 23, 16, 4, 1, '', 2, 0, 1278155556, 1278156291, 1288155556),
(10, 23, 16, 6, 1, '', 0, 0, 1278155556, 1278155556, 1279155556),
(14, 25, 23, 0, 3, '21', 0, 0, 1278143318, 1278143318, 0),
(15, 23, 16, 0, 3, '24', 0, 0, 1278156291, 1278156291, 0);

-- --------------------------------------------------------

--
-- Table structure for table `invitations`
--

CREATE TABLE IF NOT EXISTS `invitations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(10) unsigned NOT NULL,
  `friend_email` varchar(100) NOT NULL,
  `status` tinyint(1) unsigned zerofill NOT NULL,
  `hash` varchar(45) NOT NULL,
  `date_invited` datetime NOT NULL,
  `date_answered` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=3 ;

--
-- Dumping data for table `invitations`
--

INSERT INTO `invitations` (`id`, `user_id`, `friend_email`, `status`, `hash`, `date_invited`, `date_answered`) VALUES
(1, 6, 'mark@mark.com', 1, '7abbd8c953987cfba7f2c1795ae99a9e', '2010-04-18 11:50:28', '2010-04-18 11:52:23'),
(2, 6, 'mark@mark222.com', 0, '9b67eb905f61d96cd769b5b6ddbf35e9', '2010-04-27 12:53:04', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `messages`
--

CREATE TABLE IF NOT EXISTS `messages` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `from` int(10) unsigned NOT NULL,
  `to` int(10) unsigned NOT NULL,
  `date` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `ip` varchar(45) NOT NULL,
  `status` tinyint(1) unsigned NOT NULL DEFAULT '1' COMMENT '1:ok, 2:deleted',
  `message` text NOT NULL,
  `checked` tinyint(1) unsigned NOT NULL,
  `title` varchar(250) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=120 ;

--
-- Dumping data for table `messages`
--

INSERT INTO `messages` (`id`, `from`, `to`, `date`, `ip`, `status`, `message`, `checked`, `title`) VALUES
(1, 1, 2, '2010-03-15 15:18:17', '127.0.0.5', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://yammy/farms/view/1''>مزرعه دوستت</a>', 1, 'هر چه سریعتر بو دوستت کمک کن'),
(2, 1, 2, '2010-03-15 15:18:46', '127.0.0.5', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://yammy/farms/view/1''>مزرعه دوستت</a>', 0, 'هر چه سریعتر بو دوستت کمک کن'),
(3, 1, 2, '2010-03-15 15:22:02', '127.0.0.5', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://yammy/farms/view/1''>مزرعه دوستت</a>', 0, 'هر چه سریعتر بو دوستت کمک کن'),
(4, 1, 2, '2010-03-15 15:32:35', '127.0.0.5', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://yammy/farms/view/1''>مزرعه دوستت</a>', 1, 'هر چه سریعتر بو دوستت کمک کن'),
(5, 0, 2, '2010-03-27 14:34:21', '127.0.0.5', 1, 'موش ها سر فرصت مزرعتو خراب کردند و ۱۰کیلوگرم از محصولاتتو خوردن', 0, '__NOTIFICATIONMESSAGE__'),
(6, 0, 2, '2010-03-27 14:51:47', '127.0.0.5', 1, 'موش ها سر فرصت مزرعتو خراب کردند و ۱۰کیلوگرم از محصولاتتو خوردن', 0, '__NOTIFICATIONMESSAGE__'),
(7, 0, 2, '2010-03-27 14:59:22', '127.0.0.5', 1, 'موش ها رو از مزرعت فراری دادی', 0, '__NOTIFICATIONMESSAGE__'),
(8, 1, 3, '2010-03-29 10:18:31', '127.0.0.5', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(9, 1, 4, '2010-04-03 10:23:37', '127.0.0.5', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(10, 1, 5, '2010-04-03 10:24:55', '127.0.0.5', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(12, 1, 7, '2010-06-22 13:43:48', '127.0.0.5', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!'),
(13, 1, 8, '2010-04-05 17:14:36', '192.168.1.221', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(42, 6, 7, '2010-06-22 13:43:45', '192.168.1.199', 1, '\naasd\nasd\nas\nda\nsd\nasd\nas\nd\nas\ndasdasd\nasdasda\nasdasdasdas\nasdasdasdasdasd\nasdasda', 1, 'پیغام از طرف کاربر'),
(43, 6, 1, '2010-04-24 14:28:35', '192.168.1.199', 1, 'asd\nasd\nasd\nasd\nas\ndas\nd\nasdasdasd\nasdasdasdasd\nasdasdasdasd\n', 1, 'پیغام از طرف کاربر'),
(15, 0, 9, '2010-04-19 10:43:19', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(53, 6, 28, '2010-04-28 16:08:33', '192.168.1.199', 1, 'sdfsdf', 0, 'پیغام از طرف کاربر'),
(54, 6, 28, '2010-04-28 16:08:43', '192.168.1.199', 1, 'jhgjhgjhg', 0, 'پیغام از طرف کاربر'),
(55, 6, 28, '2010-04-28 16:08:50', '192.168.1.199', 1, 'jhgjhgjhg', 0, 'پیغام از طرف کاربر'),
(56, 6, 28, '2010-05-01 10:52:47', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/6/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/6''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 1, 'تقاضای دوستی از طرف کاربر'),
(32, 1, 10, '2010-04-21 11:42:48', '192.168.1.73', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(52, 6, 28, '2010-04-27 12:24:51', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/6/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/6''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 1, 'تقاضای دوستی از طرف کاربر'),
(41, 6, 7, '2010-06-22 13:43:47', '192.168.1.199', 1, 'ghfgf\nghfhgfhgfghf\nhgfhgfhgfhgfgh\nsd\nfsd\nfs\ndf\nsdf\nsd\nfs\ndf\nsdf\ns\ndf\nsdf\nsdfsdfsdf\nsdfsdfsdfsdf\nsdf\nsdf\nsd\nfsd\nfsd\nfsd\nfsd\n', 1, 'پیغام از طرف کاربر'),
(45, 1, 6, '2010-04-24 15:00:00', '192.168.1.199', 1, 'hgfhgfhgf\nsdf\nsd\nfs\ndf\nsdf\nsdf\nsdf\nsdf\nsd\nfsd\nfsd\nfsd\nfsd\nfsd\nfsd\nfsd\nfsdf\nsd\nf\nsfdf\n', 1, 'پیغام از طرف Mark'),
(46, 6, 0, '2010-04-25 14:41:37', '192.168.1.199', 1, '', 0, ''),
(47, 6, 2, '2010-04-25 16:03:26', '192.168.1.199', 1, 'jhgjhgjhg', 0, 'پیغام از طرف کاربر'),
(48, 6, 2, '2010-04-25 16:04:29', '192.168.1.199', 1, 'jhgjhgjg', 0, 'پیغام از طرف کاربر'),
(49, 6, 2, '2010-04-25 16:06:02', '192.168.1.199', 1, 'kjhkjhkjhkjh', 0, 'پیغام از طرف کاربر'),
(50, 1, 28, '2010-04-27 13:54:51', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!'),
(57, 1, 28, '2010-05-01 14:34:47', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/1/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/1''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 1, 'تقاضای دوستی از طرف Mark'),
(58, 1, 29, '2010-05-02 15:18:06', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(59, 28, 1, '2010-05-02 16:53:48', '192.168.1.199', 1, 'jhgjhgjhg', 1, 'پیغام از طرف جعفر'),
(60, 1, 30, '2010-05-03 12:56:59', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(61, 1, 2, '2010-05-05 11:37:32', '192.168.1.3', 1, 'jhg', 0, 'پیغام از طرف Mark'),
(62, 1, 2, '2010-05-05 11:39:54', '192.168.1.3', 1, 'kjhkjhkh', 0, 'پیغام از طرف Mark'),
(63, 1, 31, '2010-06-07 16:06:16', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!'),
(64, 31, 1, '2010-05-18 10:38:09', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/31/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/31''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 1, 'تقاضای دوستی از طرف غضنفر'),
(65, 1, 32, '2010-06-02 11:41:48', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(66, 1, 33, '2010-06-08 15:35:50', '192.168.1.222', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!'),
(67, 1, 34, '2010-06-09 13:12:18', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(68, 1, 35, '2010-06-09 13:14:11', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(69, 1, 36, '2010-06-09 13:15:18', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(70, 1, 37, '2010-06-09 13:18:48', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(71, 1, 38, '2010-06-09 13:20:34', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(72, 1, 39, '2010-06-09 13:21:29', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(73, 1, 40, '2010-06-09 13:22:13', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(74, 1, 41, '2010-06-09 13:24:41', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(75, 1, 42, '2010-06-09 13:25:10', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(76, 1, 43, '2010-06-09 14:00:51', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(77, 1, 44, '2010-06-09 14:02:21', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(78, 1, 45, '2010-06-09 14:04:12', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(79, 1, 46, '2010-06-09 14:05:10', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(80, 1, 47, '2010-06-09 14:05:40', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(81, 1, 48, '2010-06-09 14:07:52', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(82, 1, 49, '2010-06-09 14:12:37', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(83, 1, 50, '2010-06-09 14:13:32', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(84, 1, 51, '2010-06-09 14:14:40', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(85, 33, 1, '2010-06-09 14:15:05', '192.168.1.222', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/33/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/33''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف علی'),
(86, 33, 1, '2010-06-09 14:18:26', '192.168.1.222', 1, 'سلام چطوری؟', 0, 'پیغام از طرف علی'),
(87, 1, 52, '2010-06-09 16:22:20', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(88, 1, 53, '2010-06-12 12:12:05', '192.168.1.13', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!'),
(89, 53, 33, '2010-06-12 12:20:43', '192.168.1.13', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/53/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/53''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 1, 'تقاضای دوستی از طرف آرش'),
(90, 33, 53, '2010-06-12 12:20:59', '192.168.1.222', 1, 'اونووووووووووو!', 0, 'پیغام از طرف علی'),
(91, 53, 1, '2010-06-16 12:36:11', '192.168.1.13', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/53/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/53''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 1, 'تقاضای دوستی از طرف آرش'),
(92, 33, 53, '2010-06-12 15:26:00', '192.168.1.222', 1, 'سگ بخر واسه مزرعه ات من بکنمش!', 0, 'پیغام از طرف علی'),
(93, 31, 14, '2010-06-12 16:26:59', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/31/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/31''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف غضنفر'),
(94, 31, 22, '2010-06-12 16:28:59', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/31/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/31''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف غضنفر'),
(95, 31, 15, '2010-06-12 16:30:54', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/31/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/31''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف غضنفر'),
(96, 31, 25, '2010-06-12 16:35:55', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/31/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/31''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف غضنفر'),
(97, 31, 13, '2010-06-12 16:59:59', '192.168.1.199', 1, 'jhgjhg', 0, 'پیغام از طرف غضنفر'),
(98, 31, 13, '2010-06-12 17:01:05', '192.168.1.199', 1, 'hgfhgf', 0, 'پیغام از طرف غضنفر'),
(99, 31, 13, '2010-06-12 17:01:51', '192.168.1.199', 1, 'jhgjhg', 0, 'پیغام از طرف غضنفر'),
(100, 31, 13, '2010-06-12 17:02:05', '192.168.1.199', 1, 'gfdgfd', 0, 'پیغام از طرف غضنفر'),
(101, 33, 2, '2010-06-13 12:22:28', '192.168.1.222', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/33/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/33''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف علی'),
(105, 1, 1, '2010-06-16 12:38:27', '192.168.1.199', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://192.168.1.199/yammy/index.php/farms/view/31''>مزرعه دوستت</a>', 1, 'هر چه سریعتر بو دوستت کمک کن'),
(106, 1, 1, '2010-06-16 12:39:45', '192.168.1.199', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://192.168.1.199/yammy/index.php/farms/view/31''>مزرعه دوستت</a>', 1, 'هر چه سریعتر بو دوستت کمک کن'),
(107, 1, 1, '2010-06-16 14:03:05', '192.168.1.199', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://192.168.1.199/yammy/index.php/farms/view/31''>مزرعه دوستت</a>', 0, 'هر چه سریعتر بو دوستت کمک کن'),
(108, 1, 1, '2010-06-16 14:06:52', '192.168.1.199', 1, 'به مزرعه دوستت حمله شده و الان خودش بالا سره مزرعش نیست اگه میتونی برو و کمکش کن.  <a href=''http://192.168.1.199/yammy/index.php/farms/view/31''>مزرعه دوستت</a>', 0, 'هر چه سریعتر بو دوستت کمک کن'),
(109, 1, 54, '2010-06-20 15:44:28', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!'),
(110, 7, 6, '2010-06-22 12:52:14', '192.168.1.199', 1, 'hgfhgfgh', 0, 'پیغام از طرف علی'),
(111, 1, 55, '2010-06-22 13:14:49', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(112, 55, 1, '2010-06-22 13:16:02', '192.168.1.199', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/55/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/55''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف زدی'),
(114, 56, 9, '2010-06-22 13:39:58', '192.168.1.221', 1, 'در صورت تمایل,\r\n	<a href=''http://192.168.1.199/yammy/index.php/gateway/accept_friend/56/''>\r\n	تایید کن!\r\n	</a>\r\n        در غیر اینصورت\r\n        <a href=''http://192.168.1.199/yammy/index.php/gateway/ignore_friend/56''>\r\n        نادیده بگیر\r\n        </a>\r\n        ', 0, 'تقاضای دوستی از طرف ساسان'),
(115, 1, 57, '2010-06-27 11:27:38', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(116, 1, 58, '2010-06-28 12:15:58', '192.168.1.199', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 0, 'به سرزمین یامی خوس اومدی!'),
(117, 1, 59, '2010-06-28 14:03:40', '192.168.1.222', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!'),
(118, 33, 53, '2010-07-03 12:09:40', '192.168.1.222', 1, 'fgregregre', 0, 'پیغام از طرف علی'),
(119, 1, 60, '2010-07-03 14:25:34', '192.168.1.222', 1, 'حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی', 1, 'به سرزمین یامی خوس اومدی!');

-- --------------------------------------------------------

--
-- Table structure for table `missions`
--

CREATE TABLE IF NOT EXISTS `missions` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `level` smallint(6) NOT NULL,
  `type_id` smallint(6) NOT NULL,
  `amount` int(11) NOT NULL,
  `needed_accessory` text COLLATE utf8_persian_ci,
  `description` text COLLATE utf8_persian_ci NOT NULL,
  `deadline` smallint(6) NOT NULL COMMENT 'with hour unit',
  `type` tinyint(4) NOT NULL DEFAULT '0' COMMENT '0:specificResource;1:free',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=11 ;

--
-- Dumping data for table `missions`
--

INSERT INTO `missions` (`id`, `level`, `type_id`, `amount`, `needed_accessory`, `description`, `deadline`, `type`) VALUES
(1, 1, 1, 20, '', 'یامی به 20کیلوگرم گندم نیاز داره سریع دست بکار شو', 1, 0),
(2, 2, 2, 15, '', 'الان یامی برای ساختن پفک به ۱۵کیلوگرم ذرت نیاز داره', 4, 0),
(3, 3, 3, 25, '', 'این مرحله یامی برای ساختن چیپس نیاز به ۲۵ کیلوگرم سیب زمینی داره', 13, 0),
(4, 4, 4, 70, 'a:1:{i:0;i:20;}', 'یامی ازت ۷۰ کیلوگرم لوبیا میخواد باید زود تحویل بدی', 72, 0),
(5, 5, 5, 70, 'a:1:{i:0;i:21;}', 'یامی تو این مرحله ازت ۷۰کیلوگرم گوجه فرنگی میخواد', 72, 0),
(6, 6, 6, 100, NULL, 'یامی الان شدیدا نیاز به خیار داره که میخواد تو ۳روز ۱۰۰کیلوگرم بهش خیار تحویل بدی تو میتونی برای برداشت سریعتر محصولات برای مزرعت مهتابی بخری', 74, 0),
(7, 7, 7, 300, '', 'یامی تو این مرحله به ۳۰۰کیلوگرم پیاز در ۴ روز نیاز داره بهتر اگه مزرعت کوچیکه از موتورآب استفاده کنی', 96, 0),
(8, 8, 8, 400, 'a:1:{i:0;i:43;}', 'یامی تو این مرحله از تو ۴۰۰ کیلوگرم بادمجان میخواد', 96, 0),
(9, 9, 0, 1000, NULL, 'باید ۱۰۰۰کیلو محصول تحویل بدی نوع محصول فرقی نداره', 168, 1),
(10, 10, 0, 1500, 'a:1:{i:0;i:45;}', 'تو این مرحله باید ۱۵۰۰ کیلوگرم محصول به یامی بدی', 240, 1);

-- --------------------------------------------------------

--
-- Table structure for table `notifications`
--

CREATE TABLE IF NOT EXISTS `notifications` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `farm_id` int(11) NOT NULL,
  `type` tinyint(4) NOT NULL COMMENT '0:attack;1:reject;2:rejectByFriend;3x:resourceLack-reosurce_id;4:other',
  `details` int(11) NOT NULL,
  `body` text COLLATE utf8_persian_ci NOT NULL,
  `checked` tinyint(1) NOT NULL DEFAULT '0',
  `create_date` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=64 ;

--
-- Dumping data for table `notifications`
--

INSERT INTO `notifications` (`id`, `farm_id`, `type`, `details`, `body`, `checked`, `create_date`) VALUES
(11, 16, 32, 1277294986, 'باید هر چه سریعتر به گیاهات کود بدی', 1, 1277621176),
(13, 34, 4, 0, 'خوب تو حالا صاحب یک مزرعه شدی شروع کن به کاشتن محصولاتت و دوستاتو هم پیدا کن', 0, 1277622460),
(14, 34, 31, 1277635748, 'باید هر چه سریعتر به گیاهات آب بدی', 0, 1277635926),
(15, 34, 32, 1277635748, 'باید هر چه سریعتر به گیاهات کود بدی', 0, 1277635926),
(16, 34, 32, 1277637585, 'باید هر چه سریعتر به گیاهات کود بدی', 0, 1277637706),
(29, 35, 1, 0, 'شته ها سر فرصت مزرعتو خراب کردند و ۳۰٪ از سلامت گیاهات کم شد', 0, 1277710405),
(28, 35, 1, 0, 'شته ها سر فرصت مزرعتو خراب کردند و ۳۰٪ از سلامت گیاهات کم شد', 0, 1277710297),
(27, 35, 4, 0, 'مزرعت شته زده اگه سمپاشی نکنی در یک ساعت ۳۰٪ از سلامت گیاهات کم میشه', 0, 1277708738),
(26, 35, 31, 1277705820, 'باید هر چه سریعتر به گیاهات آب بدی', 0, 1277707910),
(30, 35, 32, 1277705822, 'باید هر چه سریعتر به گیاهات کود بدی', 0, 1277711368),
(31, 35, 1, 0, 'شته ها سر فرصت مزرعتو خراب کردند و ۳۰٪ از سلامت گیاهات کم شد', 0, 1277712536),
(32, 35, 4, 0, 'مزرعت شته زده اگه سمپاشی نکنی در یک ساعت ۳۰٪ از سلامت گیاهات کم میشه', 0, 1277712640),
(33, 35, 1, 0, 'شته ها سر فرصت مزرعتو خراب کردند و ۳۰٪ از سلامت گیاهات کم شد', 0, 1277712759),
(34, 35, 1, 0, 'شته ها سر فرصت مزرعتو خراب کردند و ۳۰٪ از سلامت گیاهات کم شد', 0, 1277712759),
(35, 35, 1, 0, 'شته ها سر فرصت مزرعتو خراب کردند و ۳۰٪ از سلامت گیاهات کم شد', 0, 1277716530),
(36, 25, 31, 1277187700, 'باید هر چه سریعتر به گیاهات آب بدی', 1, 1277717420),
(37, 25, 32, 1277187701, 'باید هر چه سریعتر به گیاهات کود بدی', 1, 1277717420),
(38, 36, 4, 0, 'خوب تو حالا صاحب یک مزرعه شدی شروع کن به کاشتن محصولاتت و دوستاتو هم پیدا کن', 0, 1277717570),
(39, 37, 4, 0, 'خوب تو حالا صاحب یک مزرعه شدی شروع کن به کاشتن محصولاتت و دوستاتو هم پیدا کن', 0, 1277721492),
(40, 28, 4, 0, 'مزرعه دوستت <a href="http://192.168.1.199/yammy/index.php/farms/view/33">عمه جان</a> بهت ۵۰۰ یامی کمک کرد', 0, 1277730401),
(41, 23, 31, 1276673789, 'باید هر چه سریعتر به گیاهات آب بدی', 1, 1278096268),
(42, 23, 32, 1276673789, 'باید هر چه سریعتر به گیاهات کود بدی', 1, 1278096268),
(62, 16, 4, 0, 'دوستت <a href="http://192.168.1.199/yammy/index.php/profile/user/31">لونا</a> موش ها رو از مزرعت فراری داد', 0, 1278156291),
(63, 16, 31, 1278151185, 'باید هر چه سریعتر به گیاهات آب بدی', 0, 1278158538),
(45, 16, 32, 1278096390, 'باید هر چه سریعتر به گیاهات کود بدی', 1, 1278096687),
(49, 25, 31, 1278142293, 'باید هر چه سریعتر به گیاهات آب بدی', 1, 1278142556),
(50, 25, 32, 1278142293, 'باید هر چه سریعتر به گیاهات کود بدی', 1, 1278142556),
(51, 23, 0, 0, 'مزرعت شته زده اگه سمپاشی نکنی در یک ساعت ۳۰٪ از سلامت گیاهات کم میشه<br/>مزرعه ی حمله کننده <a href="http://192.168.1.199/yammy/index.php/farms/view/33">عمه جان</a>', 1, 1278143029),
(52, 23, 4, 0, 'دوستت <a href="http://192.168.1.199/yammy/index.php/farms/view/33">علی</a> از مزرعت مراقبت کرد', 1, 1278143303),
(53, 23, 4, 0, 'دوستت <a href="http://192.168.1.199/yammy/index.php/farms/view/33">علی</a> از مزرعت مراقبت کرد', 1, 1278143311),
(54, 23, 4, 0, 'دوستت <a href="http://192.168.1.199/yammy/index.php/profile/user/33">علی</a> شته ها رو از مزرعت فراری داد', 1, 1278143318),
(55, 29, 31, 1276943983, 'باید هر چه سریعتر به گیاهات آب بدی', 0, 1278144348),
(56, 29, 32, 1276943983, 'باید هر چه سریعتر به گیاهات کود بدی', 0, 1278144348),
(57, 23, 31, 1278143303, 'باید هر چه سریعتر به گیاهات آب بدی', 1, 1278145290),
(58, 23, 32, 1278143311, 'باید هر چه سریعتر به گیاهات کود بدی', 1, 1278145290),
(60, 38, 31, 1275151090, 'باید هر چه سریعتر به گیاهات آب بدی', 1, 1278151238),
(61, 38, 32, 1275151093, 'باید هر چه سریعتر به گیاهات کود بدی', 1, 1278151238);

-- --------------------------------------------------------

--
-- Table structure for table `plantresources`
--

CREATE TABLE IF NOT EXISTS `plantresources` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `plant_id` int(11) NOT NULL,
  `typeresource_id` tinyint(4) NOT NULL,
  `current` tinyint(4) NOT NULL,
  `create_date` int(11) NOT NULL,
  `modified_date` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=400 ;

--
-- Dumping data for table `plantresources`
--

INSERT INTO `plantresources` (`id`, `plant_id`, `typeresource_id`, `current`, `create_date`, `modified_date`) VALUES
(1, 1, 10, 0, 1268477315, 1268477315),
(2, 1, 11, 0, 1268477315, 1268477315),
(3, 2, 8, 1, 1268481974, 1268481980),
(4, 2, 9, 1, 1268481974, 1268481983),
(5, 3, 10, 0, 1268482081, 1268552569),
(6, 3, 11, 0, 1268482081, 1268552569),
(7, 4, 10, 1, 1268552588, 1268552596),
(8, 4, 11, 1, 1268552588, 1268552598),
(9, 5, 10, 0, 1268555872, 1268555872),
(10, 5, 11, 0, 1268555872, 1268555872),
(11, 6, 12, 0, 1268562877, 1268562877),
(12, 6, 13, 0, 1268562877, 1268562877),
(13, 7, 12, 0, 1268566062, 1268566062),
(14, 7, 13, 0, 1268566062, 1268566062),
(15, 8, 14, 0, 1268637808, 1268717825),
(16, 8, 15, 1, 1268637808, 1268637829),
(17, 9, 14, 0, 1269677090, 1269754592),
(18, 9, 15, 1, 1269677090, 1269677101),
(19, 10, 14, 0, 1269756158, 1269756158),
(20, 10, 15, 0, 1269756158, 1269756158),
(30, 15, 5, 0, 1269851173, 1269851173),
(29, 15, 4, 0, 1269851173, 1269856500),
(28, 14, 3, 1, 1269850996, 1269851048),
(27, 14, 1, 1, 1269850996, 1269851016),
(31, 16, 4, 0, 1269856588, 1270555166),
(32, 16, 5, 0, 1269856588, 1270555166),
(33, 17, 4, 0, 1269861814, 1269861814),
(34, 17, 5, 0, 1269861814, 1269861814),
(35, 18, 4, 0, 1269937053, 1269942632),
(36, 18, 5, 0, 1269937053, 1269942632),
(37, 19, 4, 0, 1269946043, 1269946043),
(38, 19, 5, 0, 1269946043, 1269946043),
(42, 21, 5, 1, 1269950269, 1269950295),
(41, 21, 4, 0, 1269950269, 1269950527),
(43, 22, 4, 0, 1269950933, 1270013711),
(44, 22, 5, 0, 1269950933, 1270013711),
(74, 37, 5, 0, 1270374390, 1270374390),
(73, 37, 4, 0, 1270374390, 1270374390),
(70, 35, 3, 0, 1270287287, 1270289244),
(69, 35, 1, 0, 1270287287, 1270289244),
(68, 34, 5, 0, 1270281765, 1270281765),
(67, 34, 4, 0, 1270281765, 1270281765),
(66, 33, 3, 0, 1270281212, 1270281212),
(65, 33, 1, 0, 1270281212, 1270281212),
(72, 36, 3, 0, 1270288666, 1270290521),
(71, 36, 1, 0, 1270287666, 1270287960),
(75, 38, 4, 1, 1270533848, 1270545373),
(76, 38, 5, 1, 1270533848, 1270545296),
(77, 39, 6, 1, 1270545961, 1270627552),
(78, 39, 7, 0, 1270545961, 1270623909),
(79, 40, 1, 0, 1270546987, 1270546987),
(80, 40, 3, 0, 1270546987, 1270546987),
(81, 41, 6, 1, 1270548134, 1270623608),
(82, 41, 7, 1, 1270548134, 1270623894),
(83, 42, 6, 1, 1270623985, 1270633846),
(84, 42, 7, 1, 1270623985, 1270624142),
(85, 43, 6, 0, 1270628060, 1270628060),
(86, 43, 7, 0, 1270628060, 1270628060),
(87, 44, 8, 0, 1270633360, 1270633360),
(88, 44, 9, 0, 1270633360, 1270633360),
(89, 45, 8, 0, 1270633958, 1271153697),
(90, 45, 9, 0, 1270633958, 1270633982),
(96, 48, 9, 0, 1271144758, 1271153751),
(95, 48, 8, 0, 1271144758, 1271152600),
(97, 49, 8, 0, 1271829702, 1271829702),
(98, 49, 9, 0, 1271829702, 1271829702),
(99, 50, 8, 0, 1272458800, 1272458800),
(100, 50, 9, 0, 1272458800, 1272458800),
(104, 52, 17, 0, 1272782342, 1272782342),
(103, 52, 16, 0, 1272782342, 1272782342),
(108, 54, 17, 0, 1272783594, 1272783594),
(107, 54, 16, 0, 1272783594, 1272783594),
(112, 56, 15, 0, 1272785647, 1272785647),
(111, 56, 14, 0, 1272785647, 1272785647),
(113, 57, 16, 0, 1272786242, 1272786242),
(114, 57, 17, 0, 1272786242, 1272786242),
(115, 58, 4, 0, 1272786330, 1272786330),
(116, 58, 5, 0, 1272786330, 1272786330),
(117, 59, 16, 0, 1272787550, 1272787550),
(118, 59, 17, 0, 1272787550, 1272787550),
(119, 60, 16, 0, 1272787615, 1272787615),
(120, 60, 17, 0, 1272787615, 1272787615),
(121, 61, 1, 0, 1272788156, 1272788156),
(122, 61, 3, 0, 1272788156, 1272788156),
(123, 62, 1, 0, 1272788237, 1272788237),
(124, 62, 3, 0, 1272788237, 1272788237),
(125, 63, 1, 0, 1272788391, 1272788391),
(126, 63, 3, 0, 1272788391, 1272788391),
(127, 64, 16, 0, 1272793889, 1272793889),
(128, 64, 17, 0, 1272793889, 1272793889),
(129, 65, 16, 0, 1272794448, 1272794448),
(130, 65, 17, 0, 1272794448, 1272794448),
(131, 66, 16, 0, 1272794516, 1272794516),
(132, 66, 17, 0, 1272794516, 1272794516),
(133, 67, 16, 0, 1272794581, 1272794581),
(134, 67, 17, 0, 1272794581, 1272794581),
(168, 84, 3, 1, 1274168057, 1274168332),
(167, 84, 1, 0, 1274168057, 1274168337),
(166, 83, 3, 1, 1274167044, 1274167050),
(165, 83, 1, 0, 1274167044, 1274167055),
(169, 85, 1, 1, 1274169941, 1274169964),
(170, 85, 3, 1, 1274169941, 1274169959),
(171, 86, 1, 0, 1274170872, 1274170872),
(172, 86, 3, 0, 1274170872, 1274170872),
(173, 87, 1, 0, 1274174270, 1274174310),
(174, 87, 3, 0, 1274174970, 1274174970),
(175, 88, 16, 0, 1274176095, 1274176100),
(176, 88, 17, 0, 1274176095, 1274510085),
(177, 89, 1, 0, 1274851803, 1274851808),
(178, 89, 3, 1, 1274851803, 1274851810),
(179, 90, 1, 0, 1275813650, 1275813669),
(180, 90, 3, 0, 1275813650, 1275813675),
(189, 95, 4, 1, 1276069051, 1276334823),
(190, 95, 5, 1, 1276069051, 1276334695),
(192, 96, 3, 0, 1276072175, 1276072752),
(191, 96, 1, 0, 1276072175, 1276072749),
(193, 97, 1, 0, 1276076437, 1276077404),
(194, 97, 3, 0, 1276076437, 1276076502),
(195, 98, 1, 1, 1276086525, 1276323040),
(196, 98, 3, 1, 1276086525, 1276323053),
(197, 99, 1, 0, 1276088956, 1276088956),
(198, 99, 3, 0, 1276088956, 1276088956),
(199, 100, 1, 0, 1276322986, 1276323554),
(200, 100, 3, 0, 1276322986, 1276323555),
(201, 101, 1, 1, 1276323115, 1276329186),
(202, 101, 3, 0, 1276323115, 1276326742),
(203, 102, 1, 1, 1276329086, 1276330899),
(204, 102, 3, 1, 1276329086, 1276330898),
(205, 103, 1, 0, 1276329349, 1276330277),
(206, 103, 3, 0, 1276329349, 1276329353),
(207, 104, 14, 0, 1276330204, 1276330204),
(208, 104, 15, 0, 1276330204, 1276330204),
(209, 105, 4, 1, 1276330982, 1276338499),
(210, 105, 5, 1, 1276330982, 1276334672),
(211, 106, 1, 1, 1276333068, 1276334624),
(212, 106, 3, 0, 1276333068, 1276333072),
(213, 107, 4, 1, 1276335610, 1276344651),
(214, 107, 5, 0, 1276335610, 1276341021),
(215, 108, 1, 0, 1276336471, 1276337160),
(216, 108, 3, 0, 1276336471, 1276337161),
(217, 109, 6, 0, 1276338890, 1276346171),
(218, 109, 7, 0, 1276338890, 1276338914),
(219, 110, 1, 0, 1276346551, 1276347804),
(220, 110, 3, 0, 1276346551, 1276346638),
(221, 111, 8, 0, 1276407412, 1276407412),
(222, 111, 9, 0, 1276407412, 1276407412),
(223, 112, 6, 1, 1276415436, 1276495767),
(224, 112, 7, 0, 1276415436, 1276415445),
(225, 113, 4, 0, 1276427040, 1276432180),
(226, 113, 5, 0, 1276427040, 1276432200),
(227, 114, 6, 0, 1276495779, 1276495784),
(228, 114, 7, 0, 1276495779, 1276495785),
(229, 115, 6, 0, 1276515322, 1276515322),
(230, 115, 7, 0, 1276515322, 1276515322),
(231, 116, 14, 0, 1276515534, 1276515534),
(232, 116, 15, 0, 1276515534, 1276515534),
(233, 117, 16, 0, 1276515764, 1276515764),
(234, 117, 17, 0, 1276515764, 1276515764),
(235, 118, 16, 0, 1276516099, 1276516099),
(236, 118, 17, 0, 1276516099, 1276516099),
(237, 119, 16, 0, 1276516157, 1276516157),
(238, 119, 17, 0, 1276516157, 1276516157),
(239, 120, 16, 0, 1276516304, 1276516304),
(240, 120, 17, 0, 1276516304, 1276516304),
(241, 121, 1, 0, 1276516383, 1276516383),
(242, 121, 3, 0, 1276516383, 1276516383),
(243, 122, 14, 0, 1276516562, 1276516562),
(244, 122, 15, 0, 1276516562, 1276516562),
(245, 123, 6, 0, 1276580882, 1276589560),
(246, 123, 7, 0, 1276580882, 1276580887),
(247, 124, 6, 0, 1276586619, 1276601032),
(248, 124, 7, 0, 1276586619, 1276586624),
(249, 125, 6, 1, 1276670619, 1276670649),
(250, 125, 7, 1, 1276670619, 1276670650),
(251, 126, 1, 0, 1276673789, 1278143303),
(252, 126, 3, 0, 1276673789, 1278143311),
(253, 127, 8, 0, 1276681086, 1276681091),
(254, 127, 9, 0, 1276681086, 1276681093),
(255, 128, 8, 0, 1276943656, 1277187700),
(256, 128, 9, 0, 1276943656, 1277187701),
(257, 129, 1, 0, 1276943983, 1276943983),
(258, 129, 3, 0, 1276943983, 1276943983),
(259, 130, 1, 0, 1277032171, 1277032419),
(260, 130, 3, 0, 1277032171, 1277032451),
(261, 131, 1, 1, 1277196320, 1277196322),
(262, 131, 3, 1, 1277196320, 1277196324),
(263, 132, 1, 1, 1277197309, 1277199979),
(264, 132, 3, 0, 1277197309, 1277197343),
(265, 133, 16, 1, 1277197992, 1277197998),
(266, 133, 17, 1, 1277197992, 1277197999),
(267, 134, 16, 0, 1277205588, 1277205588),
(268, 134, 17, 0, 1277205588, 1277205588),
(269, 135, 16, 0, 1277205703, 1277205703),
(270, 135, 17, 0, 1277205703, 1277205703),
(271, 136, 4, 0, 1277206030, 1277206030),
(272, 136, 5, 0, 1277206030, 1277206030),
(273, 137, 1, 0, 1277206142, 1277206142),
(274, 137, 3, 0, 1277206142, 1277206142),
(275, 138, 6, 0, 1277207297, 1277207297),
(276, 138, 7, 0, 1277207297, 1277207297),
(277, 139, 6, 0, 1277207453, 1277207453),
(278, 139, 7, 0, 1277207453, 1277207453),
(279, 140, 1, 0, 1277208139, 1277208139),
(280, 140, 3, 0, 1277208139, 1277208139),
(281, 141, 14, 0, 1277208425, 1277208425),
(282, 141, 15, 0, 1277208425, 1277208425),
(283, 142, 1, 0, 1277211427, 1277211427),
(284, 142, 3, 0, 1277211427, 1277211427),
(285, 143, 1, 0, 1277211511, 1277211511),
(286, 143, 3, 0, 1277211511, 1277211511),
(287, 144, 16, 0, 1277211813, 1277211813),
(288, 144, 17, 0, 1277211813, 1277211813),
(289, 145, 16, 0, 1277211849, 1277211849),
(290, 145, 17, 0, 1277211849, 1277211849),
(291, 146, 1, 1, 1277271591, 1277272512),
(292, 146, 3, 0, 1277271591, 1277271601),
(293, 147, 1, 0, 1277273444, 1277273444),
(294, 147, 3, 0, 1277273444, 1277273444),
(295, 148, 1, 0, 1277273618, 1277273618),
(296, 148, 3, 0, 1277273618, 1277273618),
(320, 160, 3, 0, 1277283459, 1277294986),
(319, 160, 1, 0, 1277282459, 1277294974),
(321, 161, 16, 0, 1277621220, 1277621220),
(322, 161, 17, 0, 1277621220, 1277621220),
(323, 162, 1, 0, 1277635748, 1277636614),
(324, 162, 3, 1, 1277635748, 1277636653),
(325, 163, 1, 1, 1277637585, 1277638563),
(326, 163, 3, 1, 1277637585, 1277637755),
(395, 181, 9, 1, 1278142293, 1278142558),
(394, 181, 8, 1, 1278142293, 1278142556),
(393, 180, 7, 0, 1278096390, 1278096390),
(392, 180, 6, 0, 1278096390, 1278151185),
(391, 179, 3, 1, 1277717997, 1277718011),
(390, 179, 1, 1, 1277717997, 1277718010),
(387, 177, 5, 0, 1277705813, 1277705822),
(386, 177, 4, 0, 1277705813, 1277705820),
(385, 176, 3, 0, 1277642630, 1277642635),
(384, 176, 1, 0, 1277642630, 1277642632),
(383, 175, 3, 0, 1277640801, 1277640806),
(382, 175, 1, 1, 1277640801, 1277641876),
(399, 183, 3, 1, 1278151283, 1278151292),
(398, 183, 1, 1, 1278151283, 1278151288);

-- --------------------------------------------------------

--
-- Table structure for table `plants`
--

CREATE TABLE IF NOT EXISTS `plants` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `farm_id` int(11) NOT NULL,
  `type_id` tinyint(4) NOT NULL,
  `health` int(11) NOT NULL COMMENT '0:die,100:max',
  `weight` int(11) NOT NULL,
  `growth` int(11) NOT NULL COMMENT 'in percent',
  `reap` tinyint(4) NOT NULL DEFAULT '0',
  `create_date` int(11) NOT NULL,
  `modified_date` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=184 ;

--
-- Dumping data for table `plants`
--

INSERT INTO `plants` (`id`, `farm_id`, `type_id`, `health`, `weight`, `growth`, `reap`, `create_date`, `modified_date`) VALUES
(1, 1, 5, 0, 100, -28, 1, 1268477315, 1268562636),
(2, 2, 4, 100, 80, -248079, 1, 1267981974, 1268482053),
(3, 2, 5, 0, 11, 181503, 1, 1268482081, 1268552578),
(4, 2, 5, 100, 54, -251124, 1, 1268052588, 1268555712),
(5, 2, 5, 100, 100, -248022, 1, 1268055872, 1268555894),
(6, 2, 6, 93, 120, -241488, 1, 1268062877, 1268563565),
(7, 1, 6, 0, 0, 189321, 1, 1268566062, 1268635941),
(8, 1, 7, 0, 89, 173516, 1, 1268637808, 1268717825),
(9, 2, 7, 0, 210, 259345, 1, 1269677090, 1269754592),
(10, 2, 7, 0, 210, 315504, 1, 1269756158, 1269779054),
(11, 12, 1, 0, 20, 648, 1, 1269845680, 1269846832),
(14, 12, 1, 98, 20, -8360, 1, 1269840996, 1269851157),
(15, 12, 2, 0, 25, 5425, 1, 1269851173, 1269856549),
(16, 12, 2, 20, 25, -7145842, 1, 1269856588, 1277013230),
(17, 1, 2, 0, 75, 3266, 1, 1269861814, 1269866648),
(18, 1, 2, 0, 75, 2451, 1, 1269937053, 1269942702),
(19, 1, 2, 0, 75, 4186, 1, 1269946043, 1269949957),
(21, 1, 2, 0, 75, 7827, 1, 1269950269, 1269950542),
(22, 1, 2, 0, 75, -58466, 1, 1269950933, 1270017499),
(34, 14, 2, 20, 25, -81784, 1, 1270281765, 1270374349),
(33, 14, 1, 100, 20, -8233, 1, 1270271212, 1270281245),
(32, 14, 1, 99, 20, -8224, 1, 1270261152, 1270281176),
(36, 16, 1, 20, 20, -255508, 1, 1270289666, 1270546974),
(37, 14, 2, 20, 25, -148641, 1, 1270374390, 1270533831),
(38, 14, 2, 85, 25, -734, 1, 1270533847, 1270545381),
(39, 14, 3, 20, 30, -38883, 1, 1270545961, 1270628044),
(40, 16, 1, 97, 20, -8267, 1, 1270536987, 1270547054),
(41, 16, 3, 20, 30, -32638, 1, 1270548134, 1270623972),
(42, 16, 3, 96, 30, -66740, 1, 1270523985, 1270633925),
(43, 14, 3, 100, 30, -56838, 1, 1270528060, 1270628098),
(44, 14, 4, 20, 80, -40, 1, 1270633360, 1270885400),
(45, 16, 4, 20, 80, -6311923, 1, 1270633958, 1277197881),
(48, 14, 4, 20, 80, -431819, 1, 1271144758, 1271828577),
(49, 14, 4, 20, 80, -755482, 1, 1270829702, 1271837184),
(50, 14, 4, 20, 80, -2670205, 1, 1272458800, 1275381005),
(52, 1, 8, 100, 420, -703031, 1, 1271782342, 1272782373),
(54, 1, 8, 90, 420, -42606, 1, 1272563594, 1272784400),
(56, 1, 7, 93, 420, -48295, 1, 1272585647, 1272786222),
(57, 1, 8, 100, 560, -21848, 1, 1272586242, 1272786290),
(58, 1, 2, 100, 100, -15169, 1, 1272766330, 1272786359),
(59, 1, 8, 100, 560, -921853, 1, 1271687550, 1272787603),
(60, 1, 8, 95, 560, -822210, 1, 1271787615, 1272788025),
(61, 1, 1, 99, 80, -19227, 1, 1272768156, 1272788193),
(62, 1, 1, 99, 80, -19219, 1, 1272768237, 1272788266),
(63, 1, 1, 99, 80, -19218, 1, 1272768391, 1272788419),
(64, 1, 8, 100, 560, -21849, 1, 1272593889, 1272793938),
(65, 1, 8, 100, 560, -21831, 1, 1272594448, 1272794479),
(66, 1, 8, 100, 560, -21831, 1, 1272594516, 1272794547),
(67, 1, 8, 100, 560, -21824, 1, 1272594581, 1272794605),
(103, 28, 1, 20, 20, -1906, 1, 1276329349, 1276333055),
(102, 25, 1, 100, 20, -69, 1, 1276329086, 1276330955),
(101, 28, 1, 20, 20, -4361, 1, 1276323115, 1276329276),
(100, 25, 1, 20, 20, -4285, 1, 1276322986, 1276329071),
(99, 27, 1, 20, 20, -273, 1, 1276086956, 1276089029),
(98, 28, 1, 20, 20, -234733, 1, 1276086525, 1276323058),
(97, 25, 1, 20, 20, -244505, 1, 1276076437, 1276322742),
(96, 25, 1, 20, 20, -2238, 1, 1276072175, 1276076213),
(95, 23, 2, 20, 25, -256166, 1, 1276069051, 1276336017),
(104, 27, 7, 20, 315, -272000, 0, 1276330204, 1276940604),
(109, 25, 3, 20, 30, -33321, 1, 1276338890, 1276415411),
(106, 28, 1, 100, 20, -148, 1, 1276333068, 1276335016),
(107, 28, 2, 100, 25, -22, 1, 1276335610, 1276346432),
(108, 23, 1, 20, 20, -8096, 1, 1276336471, 1276346367),
(110, 23, 1, 20, 20, -58942, 1, 1276346551, 1276407293),
(111, 23, 4, 20, 80, -763952, 1, 1275397412, 1276413364),
(112, 25, 3, 20, 30, -37133, 1, 1276415436, 1276495769),
(113, 23, 2, 20, 25, -79700, 1, 1276427040, 1276514840),
(114, 25, 3, 20, 30, -47475, 1, 1276495779, 1276586454),
(115, 23, 3, 100, 30, -967646, 1, 1275515322, 1276515368),
(116, 23, 7, 100, 105, -746255, 1, 1275515534, 1276515589),
(117, 23, 8, 100, 140, -703018, 1, 1275515764, 1276515782),
(118, 23, 8, 100, 560, -703028, 1, 1275516099, 1276516127),
(119, 23, 8, 100, 560, -703021, 1, 1275516157, 1276516178),
(120, 23, 8, 100, 560, -703016, 1, 1275516304, 1276516320),
(121, 23, 1, 99, 80, -998691, 1, 1275516383, 1276516424),
(122, 23, 7, 100, 420, -746224, 1, 1275516562, 1276516586),
(123, 23, 3, 20, 120, -53737, 1, 1276580882, 1276667019),
(124, 25, 3, 20, 30, -40757, 1, 1276586619, 1276670576),
(125, 25, 3, 100, 30, -962985, 1, 1275670619, 1276676804),
(126, 23, 1, 20, 74, -1482638, 0, 1276673789, 1278157777),
(127, 25, 4, 20, 80, -10550, 1, 1276681086, 1276943636),
(128, 25, 4, 20, 80, -521796, 1, 1276943656, 1277717452),
(129, 29, 1, 20, 20, -1207265, 0, 1276943983, 1278153048),
(130, 31, 1, 20, 20, -152028, 0, 1277032171, 1277185999),
(131, 32, 1, 100, 20, 1796, 0, 1277196320, 1277196324),
(132, 33, 1, 20, 20, -870, 0, 1277197309, 1277199979),
(133, 16, 8, 100, 140, -1611581, 1, 1275197992, 1277205573),
(134, 16, 8, 100, 140, -1604023, 1, 1275205588, 1277205611),
(135, 16, 8, 99, 140, -1604090, 1, 1275205703, 1277205793),
(136, 16, 2, 100, 25, -1989233, 1, 1275206097, 1277206130),
(137, 16, 1, 20, 20, -999344, 1, 1276206142, 1277207286),
(138, 16, 3, 99, 30, -956944, 1, 1276207297, 1277207441),
(139, 16, 3, 95, 30, -957439, 1, 1276207453, 1277208093),
(140, 16, 1, 87, 20, -998447, 1, 1276208139, 1277208386),
(141, 16, 7, 73, 105, -1664071, 1, 1275208425, 1277210896),
(142, 16, 1, 99, 20, -998239, 1, 1276211427, 1277211466),
(143, 16, 1, 100, 20, -998220, 1, 1276211511, 1277211531),
(144, 16, 8, 100, 560, -604024, 1, 1276211813, 1277211837),
(145, 16, 8, 100, 560, -604034, 1, 1276211849, 1277211883),
(146, 16, 1, 100, 80, -17, 1, 1277271591, 1277273408),
(147, 16, 1, 100, 80, -998216, 1, 1276273444, 1277273460),
(148, 16, 1, 100, 80, -998221, 1, 1276273618, 1277273639),
(175, 35, 1, 82, 20, -18, 1, 1277640801, 1277642619),
(177, 35, 2, 20, 25, -4128, 0, 1277705813, 1277720741),
(179, 36, 1, 100, 20, 1786, 0, 1277717997, 1277718011),
(176, 35, 1, 20, 20, -59209, 1, 1277642630, 1277703640),
(180, 16, 3, 20, 120, -19405, 0, 1278096390, 1278158995),
(181, 25, 4, 97, 80, 251735, 0, 1278142293, 1278142558),
(183, 38, 1, 100, 20, 1791, 0, 1278151283, 1278151292);

-- --------------------------------------------------------

--
-- Table structure for table `relations`
--

CREATE TABLE IF NOT EXISTS `relations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `inviter` int(10) unsigned NOT NULL,
  `guest` int(10) unsigned NOT NULL,
  `invitation_date` datetime NOT NULL,
  `status` tinyint(1) unsigned zerofill NOT NULL COMMENT '1:ok, 2:denied, 3:ignored',
  `answer_date` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=25 ;

--
-- Dumping data for table `relations`
--

INSERT INTO `relations` (`id`, `inviter`, `guest`, `invitation_date`, `status`, `answer_date`) VALUES
(1, 1, 2, '2010-03-15 12:12:51', 1, '0000-00-00 00:00:00'),
(2, 7, 6, '2010-04-06 15:39:52', 1, '0000-00-00 00:00:00'),
(3, 6, 8, '2010-04-14 14:48:45', 1, '2010-04-14 14:48:45'),
(4, 6, 1, '2010-04-17 10:45:39', 1, '2010-04-17 10:45:46'),
(5, 6, 2, '2010-04-17 10:46:06', 1, '2010-04-17 10:46:06'),
(8, 6, 3, '2010-04-17 10:55:37', 1, '2010-04-17 10:55:37'),
(9, 6, 9, '2010-04-17 10:55:37', 1, '2010-04-17 10:55:37'),
(10, 6, 9, '0000-00-00 00:00:00', 1, '0000-00-00 00:00:00'),
(11, 6, 9, '0000-00-00 00:00:00', 1, '0000-00-00 00:00:00'),
(13, 1, 28, '2010-05-01 14:34:38', 1, '0000-00-00 00:00:00'),
(14, 31, 1, '2010-05-18 10:35:31', 1, '0000-00-00 00:00:00'),
(15, 33, 1, '2010-06-09 14:15:05', 0, '0000-00-00 00:00:00'),
(16, 53, 33, '2010-06-12 12:19:19', 1, '0000-00-00 00:00:00'),
(17, 53, 1, '2010-06-12 12:21:36', 1, '0000-00-00 00:00:00'),
(18, 31, 14, '2010-06-12 16:26:58', 0, '0000-00-00 00:00:00'),
(19, 31, 22, '2010-06-12 16:28:59', 0, '0000-00-00 00:00:00'),
(20, 31, 15, '2010-06-12 16:30:54', 0, '0000-00-00 00:00:00'),
(21, 31, 25, '2010-06-12 16:35:55', 0, '0000-00-00 00:00:00'),
(22, 33, 2, '2010-06-13 12:22:27', 0, '0000-00-00 00:00:00'),
(23, 55, 1, '2010-06-22 13:16:02', 0, '0000-00-00 00:00:00'),
(24, 56, 9, '2010-06-22 13:39:58', 0, '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- Table structure for table `resources`
--

CREATE TABLE IF NOT EXISTS `resources` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `price` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=4 ;

--
-- Dumping data for table `resources`
--

INSERT INTO `resources` (`id`, `name`, `price`) VALUES
(1, 'Water', 15),
(2, 'Muck', 5);

-- --------------------------------------------------------

--
-- Table structure for table `typeresources`
--

CREATE TABLE IF NOT EXISTS `typeresources` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `type_id` tinyint(4) NOT NULL,
  `resource_id` tinyint(4) NOT NULL,
  `consumeTime` float NOT NULL DEFAULT '0' COMMENT 'with hour unit',
  `minNeed` tinyint(4) NOT NULL DEFAULT '1',
  `maxNeed` tinyint(4) NOT NULL DEFAULT '5',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=18 ;

--
-- Dumping data for table `typeresources`
--

INSERT INTO `typeresources` (`id`, `type_id`, `resource_id`, `consumeTime`, `minNeed`, `maxNeed`) VALUES
(1, 1, 1, 0.25, 1, 5),
(3, 1, 2, 0.5, 1, 5),
(4, 2, 1, 0.5, 1, 5),
(5, 2, 2, 1.5, 1, 5),
(6, 3, 1, 2, 1, 5),
(7, 3, 2, 6, 1, 5),
(8, 4, 1, 6, 1, 5),
(9, 4, 2, 8, 1, 5),
(10, 5, 1, 5, 1, 5),
(11, 5, 2, 10, 1, 5),
(12, 6, 1, 10, 1, 5),
(13, 6, 2, 12, 1, 5),
(14, 7, 1, 5, 1, 5),
(15, 7, 2, 24, 1, 5),
(16, 8, 1, 6, 1, 5),
(17, 8, 2, 14, 1, 5);

-- --------------------------------------------------------

--
-- Table structure for table `types`
--

CREATE TABLE IF NOT EXISTS `types` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_persian_ci NOT NULL,
  `price` int(11) NOT NULL COMMENT 'based on each weight',
  `sell_cost` int(11) NOT NULL COMMENT 'based on each weight',
  `weight` int(11) NOT NULL COMMENT 'weight of type in each section area',
  `growth_time` float NOT NULL COMMENT 'with hour unit',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=10 ;

--
-- Dumping data for table `types`
--

INSERT INTO `types` (`id`, `name`, `price`, `sell_cost`, `weight`, `growth_time`) VALUES
(1, 'wheat', 10, 50, 20, 0.5),
(2, 'corn', 15, 80, 25, 3),
(3, 'potato', 5, 50, 30, 12),
(4, 'beans', 10, 90, 80, 70),
(5, 'tomato', 15, 120, 50, 70),
(6, 'cucumber', 20, 100, 60, 96),
(7, 'onion', 10, 70, 105, 94),
(8, 'eggplant', 15, 150, 140, 110);

-- --------------------------------------------------------

--
-- Table structure for table `userranks`
--

CREATE TABLE IF NOT EXISTS `userranks` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `type` tinyint(4) NOT NULL COMMENT '0:level;1:complete:2:grasshopper;3:bigProduct',
  `rank` int(11) NOT NULL DEFAULT '0',
  `create_date` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=latin1 AUTO_INCREMENT=21 ;

--
-- Dumping data for table `userranks`
--

INSERT INTO `userranks` (`id`, `user_id`, `type`, `rank`, `create_date`) VALUES
(1, 6, 0, 4, '2010-04-10'),
(3, 6, 3, 16, '2010-04-21'),
(4, 1, 3, 2446, '2010-05-02'),
(5, 1, 1, 2, '2010-05-02'),
(6, 31, 3, 2623, '2010-05-18'),
(7, 6, 1, 3, '0000-00-00'),
(8, 2, 0, 4, '0000-00-00'),
(9, 3, 1, 1, '0000-00-00'),
(10, 7, 1, 2, '0000-00-00'),
(11, 33, 3, 114, '2010-06-09'),
(12, 52, 3, 0, '2010-06-09'),
(13, 52, 0, 1, '2010-06-12'),
(14, 53, 3, 53, '2010-06-12'),
(15, 31, 1, 1, '2010-06-14'),
(16, 3, 3, 0, '2010-06-20'),
(17, 9, 1, 2, '0000-00-00'),
(18, 7, 3, 2017, '2010-06-22'),
(19, 57, 3, 38, '2010-06-27'),
(20, 57, 0, 1, '2010-06-28');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `first_name` varchar(250) CHARACTER SET utf8 NOT NULL,
  `last_name` varchar(250) CHARACTER SET utf8 NOT NULL,
  `email` varchar(250) CHARACTER SET utf8 NOT NULL,
  `password` varchar(250) CHARACTER SET utf8 NOT NULL,
  `photo` varchar(100) CHARACTER SET utf8 NOT NULL,
  `sex` tinyint(1) unsigned zerofill NOT NULL COMMENT '0:male',
  `birthdate` date NOT NULL,
  `city` varchar(255) CHARACTER SET utf8 NOT NULL,
  `registration_ip` varchar(45) CHARACTER SET utf8 NOT NULL,
  `registration_date` datetime NOT NULL,
  `logins` int(10) unsigned NOT NULL,
  `last_login_ip` varchar(45) CHARACTER SET utf8 NOT NULL,
  `last_login_date` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci AUTO_INCREMENT=61 ;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `first_name`, `last_name`, `email`, `password`, `photo`, `sex`, `birthdate`, `city`, `registration_ip`, `registration_date`, `logins`, `last_login_ip`, `last_login_date`) VALUES
(1, 'محمدرضا', 'حسنی', 'example@example.com', 'c4ca4238a0b923820dcc509a6f75849b', '14c204d61d9d47', 0, '1986-03-03', 'تهران', '127.0.0.5', '2010-03-06 12:06:09', 15, '192.168.1.199', '2010-06-22 10:12:17'),
(2, 'Mark2', 'Mark2', 'example2@example2.com', 'c81e728d9d4c2f636f067f89cc14862c', '', 1, '0634-02-18', 'تهران', '127.0.0.5', '2010-03-07 14:09:36', 0, '', '0000-00-00 00:00:00'),
(3, 'کاربر۳', 'کاربر‍‍پور', 'example3@example3.com', 'eccbc87e4b5ce2fe28308fd9f2a7baf3', '34c1dad38ab373', 0, '1970-01-01', 'آذربایجان غربی', '127.0.0.5', '2010-03-29 10:18:31', 5, '192.168.1.199', '2010-07-02 23:16:57'),
(7, 'علی', 'صادقی ئور', 'example5@example5.com', '5b1b68a9abf4d2cd155c81a9225fd158', '74c20a9be400ac', 0, '1998-01-12', 'آذربایجان غربی', '127.0.0.5', '2010-04-03 14:02:18', 31, '192.168.1.199', '2010-07-03 15:40:38'),
(6, 'کاربر', 'تستی', 'example4@example4.com', '73882ab1fa529d7273da0db6b49cc4f3', '64c204c3507f0f', 0, '1985-09-11', 'تهران', '127.0.0.5', '2010-04-03 10:28:54', 29, '192.168.1.3', '2010-07-03 00:06:14'),
(8, 'سیبسیب', 'سیبسیب', 'dfgdf@jhg.com', '96e79218965eb72c92a549dd5a330112', '', 0, '1991-08-22', 'تهران', '192.168.1.221', '2010-04-05 17:14:36', 0, '', '0000-00-00 00:00:00'),
(9, 'مریم', 'کاشانی', 'example7@example7.com', 'f63f4fbc9f8c85d409f2f59f2b9e12d5', '94c204cf904e87', 1, '1985-09-11', 'تهران', '192.168.1.199', '2010-04-12 15:15:28', 4, '192.168.1.199', '2010-07-02 23:16:39'),
(10, 'آرش', 'خسرونژاد', 'katatonyyk@yahoo.com', 'e10adc3949ba59abbe56e057f20f883e', '', 0, '0634-02-18', 'تهران', '192.168.1.73', '2010-04-21 11:42:48', 0, '', '0000-00-00 00:00:00'),
(11, 'mark3', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(12, 'mark4', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(13, 'mark5', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(14, 'mark6', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(15, 'mark7', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(16, 'mark8', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(17, 'mark9', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(18, 'mark10', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(19, 'mark11', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(20, 'mark12', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(21, 'mark13', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(22, 'mark14', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(28, 'جعفر', 'اوشکول', 'jafar@jafar.com', 'c1626360ec26d5060658143123b8a5d8', '', 0, '2003-01-02', 'تهران', '192.168.1.199', '2010-04-27 11:31:20', 0, '', '0000-00-00 00:00:00'),
(24, 'mark15', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(25, 'mark16', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(26, 'mark19', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(27, 'mark20', '', '', '', '', 0, '0000-00-00', '', '', '0000-00-00 00:00:00', 0, '', '0000-00-00 00:00:00'),
(29, 'حسن', 'حسن پور', 'hasan@hasan.com', 'c86d271bb7321f934570825e55e77e2c', '', 0, '2002-01-31', 'ایلام', '192.168.1.199', '2010-05-02 15:18:06', 0, '', '0000-00-00 00:00:00'),
(30, 'الب', 'الب', 'mmm@mmm.mmm', '9aee390f19345028f03bb16c588550e1', '', 0, '0634-02-18', 'خارج از ایران', '192.168.1.199', '2010-05-03 12:56:59', 0, '', '0000-00-00 00:00:00'),
(31, 'لونا', 'کشمیش پرور', 'example10@example10.com', '6d071901727aec1ba6d8e2497ef5b709', '314c204dd01fee9', 1, '2002-03-03', 'سمنان', '192.168.1.199', '2010-05-08 14:16:18', 55, '192.168.1.199', '2010-07-03 15:43:37'),
(32, 'سیتلتال', 'تالتال', 'mark12@mark12.com', '93279e3308bdbbeed946fc965017f67a', '', 0, '0634-02-18', 'خارج از ایران', '192.168.1.199', '2010-06-02 11:41:48', 1, '192.168.1.199', '2010-06-02 11:42:15'),
(33, 'علی', 'اصغری', 'info@fouad.ir', 'e10adc3949ba59abbe56e057f20f883e', '334c2ee93187685', 0, '1986-06-19', 'تهران', '192.168.1.222', '2010-06-08 15:29:55', 30, '192.168.1.222', '2010-07-03 16:29:16'),
(51, 'نتانت', 'انتانان', 'asdasd@asdasd.asdasd', 'a8f5f167f44f4964e6c998dee827110c', '', 0, '1943-04-12', 'زنجان', '192.168.1.199', '2010-06-09 14:14:40', 3, '192.168.1.199', '2010-06-09 15:12:22'),
(50, 'تال', 'last_name', 'example321@example321.com', '4297f44b13955235245b2497399d7a93', '', 1, '1943-03-22', 'سیستان و بلوچستان', '192.168.1.199', '2010-06-09 14:13:32', 1, '192.168.1.199', '2010-06-09 14:13:32'),
(52, 'نمتمنتنمت', 'منتمنت', 'sss@sss.sss', 'af15d5fdacd5fdfea300e88a8e253e82', '', 0, '1932-04-11', 'خراسان شمالی', '192.168.1.199', '2010-06-09 16:22:20', 2, '192.168.1.199', '2010-06-16 14:38:26'),
(53, 'آرش', 'خوش تیپ', 'arash.r@parspake.com', 'd813bdfd3bdd9e45ffa59a57f776b5af', '', 0, '0634-02-18', 'خارج از ایران', '192.168.1.13', '2010-06-09 16:57:37', 2, '192.168.1.13', '2010-06-12 10:40:18'),
(54, 'محمدرضا', 'کاغذگریان', 'markteams@gmail.com', 'e29ce8e478bcaf00f2fc628227d1269e', '544c204fb347ec5', 0, '1985-09-11', 'تهران', '192.168.1.199', '2010-06-20 15:36:50', 2, '192.168.1.199', '2010-06-22 10:21:16'),
(55, 'زدی', 'مریمی', 'zzz@zzz.zzz', '453e41d218e071ccfb2d1c99ce23906a', '554c2078149e32d', 1, '2001-06-12', 'فارس', '192.168.1.199', '2010-06-22 13:14:49', 1, '192.168.1.199', '2010-06-22 13:14:49'),
(56, 'ساسان', 'بهزادی', 'sassan_behzadi@yahoo.com', '96e79218965eb72c92a549dd5a330112', '564c207d3084a5a', 0, '1961-07-11', 'تهران', '192.168.1.221', '2010-06-22 13:23:16', 2, '192.168.1.221', '2010-06-22 13:47:19'),
(57, 'حسن', 'قلی زاده', 'hasani@hasani.com', 'c86d271bb7321f934570825e55e77e2c', '574c26f7190aad9', 0, '1970-01-01', 'آذربایجان شرقی', '192.168.1.199', '2010-06-27 11:27:38', 17, '192.168.1.199', '2010-07-02 23:12:57'),
(58, 'نتانتا', 'نتانتا', 'nnn@nnn.com', '4c8b40018f893d4384fcfe60302cb46a', '', 0, '2002-03-13', 'اصفهان', '192.168.1.199', '2010-06-28 12:15:58', 1, '192.168.1.199', '2010-06-28 12:15:58'),
(59, 'فواد', 'امیری دوم', 'fouad.amiri@gmail.com', 'e10adc3949ba59abbe56e057f20f883e', '', 0, '1986-06-19', 'تهران', '192.168.1.222', '2010-06-28 14:02:03', 2, '192.168.1.222', '2010-06-28 14:17:09'),
(60, 'نسترن', 'محمدنیا', 'nac@yahoo.com', 'e10adc3949ba59abbe56e057f20f883e', '604c2f09482e6cc', 1, '1987-06-17', 'تهران', '192.168.1.222', '2010-07-03 14:24:49', 1, '192.168.1.222', '2010-07-03 14:24:49');
