<?php
	/*
	    Registration
	*/
	$lang['filling_error']			= "خطای ورود اطلاعات";
	$lang['choose_captcha']         = "بر اساس راهنمایی من, یکی از اشیا را باید انتخاب کنی!<BR />برای این کار روی شکل مورد نظر کلیک کن!";
	$lang['starred_filling']        = "همه ی فیلدهای ستاره دار باید پر شوند!<BR />به نظر می رسد که یک یا چند تا از آن ها را جا انداخته ای!";
	$lang['email_failure1']         = "ایمیلی که وارد کردی حقیقتا ایمیل نیست!<BR />ایمیل به صورت example@example_domain.com یا چیزی شبیه این باید باشد!";
	$lang['email_repeated']         = "این ایمیل قبلا هم در سیستم ثبت شده!<BR />اگر مطمئنی آن را قبلا در این بازی ثبت نکرده ای, از طریق یادآوری رمز, رمز پروفایل را به دست آور و به وسیله ی آن وارد بازی شو!";
	$lang['date_over']				= "تاریخ را اشتباه وارد کردی!";
	$lang['reg_error']              = "با عرض معذرت, انگار خطای نامشخصی در ثبت نام رخ داد!<BR />سعی در حال آن دارم. کمی صبر کن و دوباره تلاش کن.<BR />";
	$lang['captcha_error']          = "شی مورد نظر را اشتباه انتخاب کردی!<BR />دوباره تلاش کن.";
	
	/*
	    Inbox
	*/
	$lang['message_delete']			= "پاک کردن پیام";
	$lang['message_delete_text']	= "مطمئنی که می خواهی این پیام را پاک کنی؟<BR />بعد از تایید امکان بازیابی مجدد پیام وجود ندارد.";
	
	/*
	    Edit profile
	*/
	$lang['password_error']         = "رمزی که وارد کردی با رمز کنونی هماهنگ نبود یا رمز جدید با تکرارش یکی نبود!";