<?php

	/*
		Home
	*/
	$lang['laws'] 		    = "قوانین";
	$lang['contact'] 	    = "تماس با ما";
	
	/*
	    Registration
	*/
	
	$lang['name']			= "نام";
	$lang['last_name']		= "نام خانوادگی";
	$lang['sex']			= "جنسیت";
	$lang['male']			= "مرد";
	$lang['female']			= "زن";
	$lang['birthdate']		= "تولد";
	$lang['pre_year']       = "&#1777;&#1779;";
	$lang['day']			= "روز";
	$lang['month']			= "ماه";
	$lang['year']			= "سال";
	$lang['email']			= "ایمیل";
	$lang['yes']			= "بله";
	$lang['no']				= "خیر";
	$lang['password']		= "رمز";
	$lang['photo']			= "عکس";
	$lang['submit']			= "ثبت";
	$lang['province']		= "استان";
	
	$lang['key']			= "کلید";
	$lang['home']			= "خانه";
	$lang['zoom']			= "ذره بین";
	$lang['link']			= "زنجیر";
	$lang['shopping']		= "چرخ خرید";
	$lang['lock']			= "قفل";
	$lang['tool']			= "کیف";
	$lang['flag']			= "پرچم";
	$lang['cut']			= "قیچی";
	$lang['calculator']		= "ماشین حساب";
	$lang['calendar']		= "تقویم";
	
	$lang['must_be_filled']	= "ستاره دارها باید پر شوند.";
	$lang['java_enables']	= "جاوا اسکریپت مرورگر حتما فعال باشد.";
	$lang['captcha_choose'] = " را انتخاب کنید!";
	
	$lang['welcome_title'] 	= "به سرزمین یامی خوس اومدی!";
	$lang['welcome_body'] 	= "حالا میتونی از پروفایلت بری و مزرعه داریتو شروع کنی";
	
	/*
	    Profile
	*/
	$lang['m_title']		= "آقای";
	$lang['f_title']		= "خانم";
	$lang['register_date']	= "تاریخ عضویت";
	$lang['add_to_friend']  = "اضافه به دوستان";
	$lang['report_abuse']	= "گزارش خلاف";
	$lang['invitation']		= "دعوت دوستان";
	$lang['friends_email']	= "ایمیل دوست";
	$lang['profile_set']	= "تنظیم پروفایل";
	$lang['wait_a_moment']	= "چند لحظه صبر کن!";
	$lang['new_message']	= "پیام از طرف XXX";
	$lang['message_sent']	= "پیام ارسال شد.";
	$lang['message_nsent']	= "خطا در ارسال پیام! اول وارد سایت شو بعد پیام بده!";
	$lang['new_messages']	= "پیام جدید داری!";
	$lang['go_inbox']		= "صندوق پیامت رو ببین.";

        /*
         * farm Farm
         */

        $lang['addFarm']        = "ثبت مزرعه";
        $lang['addFarmName']        = "دوست داری اسن مزرعت چی باشه";
        $lang['plantCapacity']  = "اگه الان تو مزرعت از این گیاه بکاری و موقع درو سلامتش کامل باشه میتونی __CAPACITY__ کیلوگرم برداشت کنی";

        $lang['inbox']			= "پیام ها";
	$lang['profile']        = "پروفایل";
	$lang['logout']	        = "خروج";
	$lang['kph']	        = "کیلومتر بر ساعت";
	$lang['aprox']          = "حدود";
	
	$lang['no_friend']      = "هیچ دوستی توی لیست نیست!";
	
	$lang['delete_vote']    = "رای قبلیت رو پاک کن";
	$lang['redesign_car']   = "طراحی مجدد ماشین";
	$lang['redesign_desc']  = "این یکی از بین می ره, ادامه؟";
	
	$lang['no_rank']        = "هیچ مقام شایان ذکری نیست!";
	
	$lang['times']          = "بار مقام";
	$lang['f1']		        = "اول";
	$lang['f2']		        = "دوم";
	$lang['f3']		        = "سوم";
	$lang['f4']		        = "چهارم";
	$lang['f5']		        = "پنجم";
	$lang['f6']		        = "ششم";
	$lang['f7']		        = "هفتم";
	$lang['f8']		        = "هشتم";
	$lang['f9']		        = "نهم";
	$lang['f10']	        = "دهم";
	$lang['f11']	        = "یازدهم";
	$lang['f12']	        = "دوازدهم";
	$lang['f13']	        = "سیزدهم";
	$lang['f14']	        = "چهاردهم";
	$lang['f15']	        = "پانزدهم";
	$lang['f16']	        = "شانزدهم";
	$lang['f17']	        = "هفدهم";
	$lang['f18']	        = "هجدهم";
	$lang['f19']	        = "نوزده";
	$lang['f20']	        = "بیستم";
	$lang['voters']	        = "از XXX رای";
	$lang['profile_desc']	= "رای ها میانگین رای راننده ها به ماشین های این راننده است.";
	$lang['invite']	        = "دعوت دوست";
	$lang['search']	        = "جستجوی دوست";
	$lang['friends_name']   = "نام دوست";
	
	$lang['report_body']    = "در صورتی که این راننده از قوانین سایت تخطی کرده و مطمئن هستی دکمه ی تایید رو بزن.<BR />در صورتی که این راننده خلافکار نباشه, یک امتیاز منفی در سابقه ی خودت ثبت خواهد شد!";

	/*
	    Inbox
	*/
	$lang['from']	        = "از طرف";
	$lang['date']	        = "تاریخ";
	$lang['title']	        = "عنوان";
	$lang['message_here']   = "روی عنوان هر پیام کلیک کن و متن را در این جا ببین!";
	$lang['endof_message']  = "انتهای پیام";
	
	$lang['message_all_delete'] = "مطمئنی می خوای همه ی پیام ها رو پاک کنی؟<BR />این کار قابل بازگشت نیست.";
	$lang['message_all_deletet']= "همه ی پیام ها پاک بشه؟!";
	
	$lang['add_request']    = "تقاضای دوستی از طرف XXX";
	$lang['add_requestbody']= "در صورت تمایل,
	<a href='" . base_url() . "gateway/accept_friend/XXX/'>
	تایید کن!
	</a>
        در غیر اینصورت
        <a href='" . base_url() . "gateway/ignore_friend/XXX'>
        نادیده بگیر
        </a>
        ";
        $lang['ignore_request'] = "رد تقاضای دوستی از طرف  __SUGGESTNAME__";
        $lang['ignore_requestbody']  = "تقاضای دوستی شما از طرف __SUGGESTNAME__ رد شد";
	$lang['delete_all']     = "پاک کردن همه";
	
	/*
		Edit profile
	*/
	$lang['new_password']	= "رمز جدید";
	$lang['repassword']		= "تکرار رمز";
	$lang['no_pass_change'] = "اگر مایل به تغییر رمز نیستی, فیلدهای رمز را خالی بگذار.";

	/*
	    Friends
	*/
	$lang['level_label']			= "مرحله";
	$lang['delete_friend']	= "حذف از دوستان";
	$lang['are_friends']	= "دوست هستید";
	$lang['block_friend']	= "بلاک شده اید";
	$lang['you_are']		= "خود تو!";
	$lang['all_friends']	= "همه دوستان";
	
	/*
	    Rally Selection
	*/
	$lang['seletion_hint']  = "
	<B>یک مسیر انتخاب کن!</B>
	<BR /><BR />
	اول نوع مسیر مورد نظرت رو انتخاب کن و بعد طول مسیر رو.<BR />
	بعضی مسیرها برای بعضی راننده ها قفل هستند. یعنی اون راننده هنوز از امتحانات لازم برای شرکت در مسیر نگذشته. برای این که بتونی در مسیرهای سخت تری که قفل هستند شرکت کنی, اول باید مسیرهای راحت تری که باز هستند رو با رتبه ی خوب به پایان ببری.
	<BR />
	در ضمن هر موقع که خواستی می تونی برگردی و در مسیرهایی که قبلا بازی کرده بودی دوباره بازی کنی و رکوردهای قبلیت رو بهتر کنی.
	";
	$lang['km100'] = "&#1777;&#1776;&#1776; ک.م";
	$lang['km300'] = "&#1779;&#1776;&#1776; ک.م";
	$lang['km500'] = "&#1781;&#1776;&#1776; ک.م";
	
	/*
	    Rally
	*/
	$lang['time_hint']		= "حدود XXX به ایست بعدی می رسی.<BR />اگه همه ی شرایط مثل الان باقی بمونه!";
	$lang['navigate_hint']	= "مسافت طی شده: <font style='color:yellow;'>XXX کیلومتر </font>
	<BR />
	کل طول مسیر: <font style='color:yellow;'>XX کیلومتر </font>
	<BR />
	درصد طی شده: <font style='color:yellow;'>X%</font> از مسیر
	";
	$lang['new_questions']  = "سوال جدید";
	$lang['right_title']	= "جواب درست بود";
	$lang['right_answer0']	= "آفرین! جوابت درست بود.<BR />هم 20 امتیاز گرفتی و هم 10 کیلومتر سرعتت رفت بالا!";
	$lang['right_answer1']	= "آفرین! جوابت درست بود.<BR />این سوال بهت 15 کیلومتر بر ساعت سرعت بیشتر داد!";
	$lang['right_answer2']	= "آفرین! جوابت درست بود.<BR />این سوال 25 کیلومتر بر ساعت سرعتت رو بالا برد!";
	$lang['right_answer5']	= "آفرین! جوابت درست بود.<BR />کلش رو خوابوندی و 5 کیلومتر از سرعتش گرفتی و به سرعت خودت اضافه کردی!";
	$lang['wrong_title']	= "جواب اشتباه بود!";
	$lang['wrong_answer']	= "ای بابا! جوابت اشتباه بود.<BR /> جواب درست رو می تونی توی اینترنت یا بخش آموزش های همین سایت پیدا کنی. بعدا دوباره این سوال رو ازت می پرسم!";
	$lang['no_question']	= "<BR /><BR />هیچ سوالی توی آرشیوت نیست!<BR /><BR />با گذر از مسیرها و ایست ها, سوال هایی ازت پرسیده می شه که می تونی با کلیک کردن روی همین موبایل, بهشون جواب بدی.";
	$lang['fuel_fail']		= "وضع بنزین ماشینت خرابه. سعی کن توی ایست های بعدی به سوال ها درست جواب بدی.";
	$lang['oil_fail']		= "وضع روغنت ماشینت خرابه. سعی کن توی ایست های بعدی به سوال ها درست جواب بدی.";
	$lang['water_fail']		= "وضع رادیاتور ماشینت خرابه. سعی کن توی ایست های بعدی به سوال ها درست جواب بدی.";
	$lang['tiredness_fail']	= "خیلی خسته به نظر می رسی! توی ایست های بعدی بیشتر دقت کن و سوال ها رو جواب بده تا خستگیت برطرف بشه!";
	$lang['max_speed']		= "یووووووهوووووو! داری با حداکثر سرعت مجاز توی این مسیر حرکت می کنی. چه حالی می ده!";
	$lang['tire_fail']		= "وضع لاستیک های ماشینت خرابه. سعی کن توی ایست های بعدی به سوال ها درست جواب بدی.";
	$lang['info_alert']		= "برای حرکت سریع تر یا بهبود وضعیت ماشین باید به سوال ها درست جواب بدی. الان XXX سوال داری که باید بهش جواب بدی.";
	$lang['rest_till']      = "تا اون موقع از مناظر لذت ببر!";
	
	$lang['finished_title'] = "آفرین! مسیر XXX رو تموم کردی!";
	$lang['finished_msg']	= "موفق شدی مسیر XXX رو در کمتر از XX ساعت تموم کنی.<BR /><BR />اگه می خوای ببینی رتبه ی نهاییت چند می شه باید صبر کنی تا این مسیر بسته بشه. این مسیر هم تا یکشنبه ی بعد بسته می شه و مقام ها توش مشخص می شه.<BR /><BR />برای مشاهده ی مقام های فعلی می تونی به
	<a href='" . base_url() . "drivers_list/race/0/X/'>
	صفحه ی رتبه های مسیر XXX
	</a>
	مراجعه کنی.
	";
	
	$lang['failed_title'] 	= "متاسفانه مسیر XXX رو تموم نکردی!";
	$lang['failed_msg']		= "برای طی کردن مسیر حداکثر XX ساعت فرصت داری که نتونستی توی این زمان مسیر رو تموم کنی.<BR /><BR />امیدوارم دفعه ی بعد موفق باشی!<BR /><BR />
	برای مشاهده ی رتبه ی سایر راننده ها در این مسیر می تونی به
	<a href='" . base_url() . "drivers_list/race/0/X/'>
	صفحه ی رتبه های مسیر XXX
	</a>
	مراجعه کنی.
	";
	
	$lang['race_length']    = "km";
	$lang['fromx']		    = "از";
	$lang['race_passed']    = "طی شده";
	$lang['current_city']   = "موقعیت";
	$lang['speed']          = "سرعت";
	$lang['question']       = "سوال";
	$lang['person']			= "نفر";
	$lang['race_start']     = "ابتدای مسیر";
	$lang['all_drivers']	= "شرکت کننده ها";
	$lang['rank']           = "رتبه";
	$lang['likeit']	    	= "باحاله";
	$lang['nlikeit']	   	= "حذف";
	$lang['nlikeitd']	   	= "حذف از لیست باحال ها!";
	$lang['new_woym']	   	= "جدید";
	$lang['delete_woym']   	= "حذف";
	$lang['edit_woym']	   	= "تغییر";
	$lang['times']	    	= "بار";
	$lang['submitd']	    = "ثبت";
	$lang['peoplelike']	    = "نفر خوششون اومده!";
	$lang['nodiary']	    = "هنوز مطلبی گفته نشده!";
	$lang['delete_last']    = "مطمئنی می خواهی آخرین مطلب پاک شود؟";
	$lang['delete_last_title']	= "پاک کردن مطلب";
	$lang['body']			= "متن";
	$lang['rank_pos']		= "رتبه در بین همه راننده هایی که تا اینجای مسیر اومدند";
	$lang['speed_pos']		= "حداکثر سرعت مجاز در این مسیر XXX کیلومتر";
	$lang['not_answered']	= "سوال داری که هنوز جواب ندادی!";
	$lang['challengim']		= "این راننده ی جلوی تو توی مسیره! باهاش کل کل کن!";
	$lang['challengleft']	= "باهاش کل انداختی و تا XXX وقت داره واسه جواب";
	$lang['challengans']	= "باهات کل انداخته! جواب سوال رو بده و کلش رو بخوابون";
	$lang['challnegimtitl1']= "می خوای باهاش کل کل کنی؟";
	$lang['challnegim1']	= "اگه باهاش کل کل کنی, تا 10 ساعت وقت داره تا به یه سوالی که ازش پرسیده می شه جواب بده. اگه تو این مدت جواب نده یا جواب غلط بده تو برنده ای و 5 کیلومتر از سرعتش کم می شه و به سرعت تو اضافه می شه.<BR />اگه درست جواب بده برعکسش اتفاق میفته!";
	$lang['challnegimtitle']= "کل کل ارسال شد!";
	$lang['challnegmsgt']   = "توی مسیر باهات کل کل کرده!";
	$lang['challnegmsg']	= "XXX باهات کل انداخته! تا XX وقت داری که بری توی بخش بازی و کلش رو بخوابونی!<BR />برای این کار روی دکمه ی کل کل کلیک کن و به سوال جواب بده! اگه درست جواب بدی 5 کیلومتر از سرعت اون کم می شه و به سرعت تو اضافه می شه ولی اگه غلط جواب بدی برعکسش اتفاق میفته!<BR />می تونی تا قبل از پایان زمان هر موقع که خواستی کل کل رو لغو کنی و هیچ امتیاز منفی نگیری ولی اگه به سوال تا اتمام زمان جواب ندی مثل جواب منفی به سوال تلقی می شه!";
	
	$lang['challnegim_txt']	= "برای کل کل, یک سوال ازش پرسیده می شه که تا XXX وقت داره بهش جواب بده.<BR />در صورتی که جواب غلط بده 5 کیلومتر از سرعتش کم می شه و به سرعت تو اضافه می شه و اگه درست جواب بده برعکسش پیش میاد!<BR />اگر هم توی این وقتی که داره جواب نده به عنوان جواب غلط ثبت می شه.";
	$lang['challnegim_ert'] = "خطایی در کل کل کردن رخ داد! دوباره تلاش کن.";
	$lang['challnegimerti'] = "خطایی رخ داد!";
	
	$lang['challnegcan_txt']= "کل کل با موفقیت لغو شد!";
	$lang['challnegcan_ert']= "خطایی در لغو کل کل رخ داد! دوباره تلاش کن.";
	$lang['cancel_chal']    = "با لغو کل کل هیچ امتیازی از هیچ کی کم نمی شه!";
	
	$lang['challnegcan']    = "XXX کل کل باهات رو لغو کرده!<BR />هیچ امتیازی از هیچ کی کم نمی شه و به هیچ کی هم امتیاز اضافه نمی شه.";
	$lang['challnegcant']   = "کل کل باهات رو لغو کرده!";
	
	$lang['challnegwon']    = "XXX توی کل کل از تو شکست خورد و سوالش رو غلط جواب داد!<BR />5 کیلومتر از سرعتش کم شد و به سرعت تو اضافه شد.";
	$lang['challnegwont']   = "توی کل کل منو شکست دادی!";
	$lang['challneglost']   = "XXX توی کل کل به سوالش جواب داد و تو رو برد!<BR />5 کیلومتر از سرعت تو کم شد و به سرعت اون اضافه شد.";
	$lang['challneglostt']  = "کلت رو خوابوندم!";
	
	$lang['answerall']		= "به همه ی سوال ها جواب بده تا از رقیب هات جلو بزنی!";
	$lang['answerall1']		= "با این جواب دادنت! اینطوری نمی تونی مقام بیاری. بیشتر دقت کن!";
	$lang['answerall2']		= "بدک نبود. یه کم وضعت بهتر شد ولی اگه همه رو درست جواب می دادی عالی می شد.";
	$lang['answerall3']		= "بابا ماشالله! ترکوندی که. کلی اوضاعت بهتر می شه اینطوری.";
	/*
	    List
	*/
	$lang['machine_of']		= "خودروی";
	$lang['next']		    = "بعدی";
	$lang['previuos']	    = "قبلی";
	$lang['first']		    = "اولی";
	$lang['last']		    = "آخری";
	$lang['no_match']	    = "هیچ موردی یافت نشد!";
	$lang['race_name']	    = "نام مسیر";

	/*
	    Message
	*/
	$lang['m_title1']       = "ثبت نام انجام شد!";
	$lang['m_body1']	= "حالا اول وارد سایت بشو بعد برو مزرعتو بوجود بیار";
	
	$lang['m_title0']      = "رمز یا ایمیلی که وارد کردی اشتباهه!";
	$lang['m_body0']		= "دوباره تلاش کن!";
	
	$lang['m_title5']       = "امیدوارم با هم دوست بشید!";
	$lang['m_body5']		= "یه پیغام دوستی براش ارسال شد.<BR />اگه تایید بکنه با هم دوست می شید!";
	
	$lang['m_title6']       = "یه خطایی رخ داد!";
	$lang['m_body6']		= "قبلا به عنوان دوست بهش پیغام داده بودی.<BR />منتظر تایید اون پیغام باش.";
	
	$lang['m_title7']       = "از لیست دوستان حذف شد.";
	$lang['m_body7']		= "این راننده با موفقیت از لیست دوستانت حذف شد.";
	
	$lang['m_title8']       = "یه خطایی رخ داد!";
	$lang['m_body8']		= "دوباره تلاش کن!";
	
	$lang['m_title9']       = "با موفقیت دعوت شد.";
	$lang['m_body9']		= "این دوستت قبلا توی بازی نبود و یه ایمیل دعوتنامه با نام خودت براش ارسال شد.";
	
	$lang['m_title10']      = "یه خطایی رخ داد!";
	$lang['m_body10']		= "اصلا چنین مسیری وجود نداره! درست انتخاب کردی؟<BR />اگه مطمئنی همه چیز درسته شاید ما در حال بازسازی مسیرها باشیم. یه چند دقیقه ی دیگه دوباره تلاش کن.";

	$lang['m_title11']      = "یه مسیر رو دو بار در هفته نمی تونی بری!";
	$lang['m_body11']		= "هر مسیر رو در هر هفته یه بار می تونی طی کنی.<BR />هفته ی دیگه می تونی دوباره تو همین مسیر مسابقه بدی.";
	
	$lang['m_title12']      = "اصلا این راننده توی بازی رنو نیست!";
	$lang['m_body12']		= "مطمئنی که آدرس پروفایل این راننده رو درست وارد کردی؟!";
	
	$lang['m_title13']      = "نمی شه که چند بار گزارش خلاف داد!";
	$lang['m_body13']		= "قبلا این راننده رو به عنوان خلافکار گزارش داده بودی و بررسیش می کنیم.";
	
	$lang['m_title14']      = "مرسی, گزارش خلاف ثبت شد.";
	$lang['m_body14']		= "گزارش خلاف ثبت شد و به زودی بررسیش می کنیم.";

	$lang['m_title15']      = "با موفقیت ارسال شد!";
	$lang['m_body15']		= "پیام ارسال شد و به زودی می خونیمش!<BR /><BR />با تشکر";

	$lang['m_title16']      = "یه خطایی رخ داد!";
	$lang['m_body16']		= "پیام ارسال نشد, یه خورده وقت دیگه دوباره تلاش کن.";

	$lang['m_title17']      = "برای این کار باید وارد سایت بشی!";
	$lang['m_body17']		= "لطفا قبل از این کارها وارد سایت شو یا اگه هنوز ثبت نام نکردی, ثبت نام کن!
	<BR /><BR />
	<a href='" . base_url() . "registration/'>
	صفحه ی ثبت نام
	</a>
	";

        $lang['m_title18']      = "یه خطایی رخ داد!";
	$lang['m_body18']	= "کاربر درخواست خود را پس گرفته و نمیتوانید تایید کنید";

	/*
	    Contact
	*/
	$lang['contact_ren']	= "اگه در مورد بازی نیست لطفا پیامت رو
	<a href='http://www.renault.co.ir/?page=11&lang=fa' target='_blank'>
	از اینجا
	</a>
	بفرست.
	";