<?php

	$lang['helpPage']         = "راهنما";
	$lang['registration_title']         = "ثبت نام";
	$lang['profile_title']		        = "پروفایل";
        $lang['home_title']		    	    = "سرزمین مزرعه داران یامی";
	$lang['friends_title']		   	    = "دوستان";
	$lang['messages_title']		   	    = "پیام ها";
	$lang['edit_title']			   	    = "تنظیمات";
	$lang['search_title'] 		        = "جستجو";
	$lang['message_title']  			= "پیام";
	$lang['contact_title']	 	 		= "تماس با ما";
	$lang['policy_title']	 	 		= "قوانین";



        $lang['helpText']		= "
<span class=\"helpTitle\">معرفی بازی</span>
بازی مزرعه داران یامی یک بازی اینترنتی مفرح با موضوع مزرعه داری در یک سرزمین بزرگ و ارتباط با دیگر مزرعه داران است
<br/><br/>

<span class=\"helpTitle\">نحوه ی بازی</span>
در این بازی بعد از ثبت نام میتونی مزرعه داری رو شروع کنی که برای تمام مراحل بازی در خود محیط بازی راهنمایی هایی دریافت میکنی که کمک میکنه بازی رو کاملا یاد بگیری
<br/><br/>

<span class=\"helpTitle\">اهداف بازی</span>
هدف اصلی این بازی فراهم آوردن فضایی برای تجربه کردن فعالیت کشاورزی و مزرعه داری در  محیط بازی های آنلاین میباشد که در حین انجام بازی مهارت های کنترل کردن قسمت های مختلف یک مزرعه و مدیریت آنها و همچنین برنامه ریزی کردن برای انجام کارهای گوناگون یک مزرعه را تجربه میکنید. در ضمن با توجه به ماهیت اجتماعی که بازی دارد با کمک کردن به دیگر مزرعه داران و تعاملی که با دوستانتان در این بازی بوجود می آید تجربه ی یک فعالیت اجتماعی را نیز بدست می آورید
<br/><br/>

<span class=\"helpTitle\">مراحل بازی</span>
این بازی شامل ۱۰ مرحله جداگانه میباشد که در هر مرحله درخواست میزان مشخصی از گیاهی داده میشود که باید سعی کرد تا محصول را به همان میزان درخواست شده تحویل داد بعد از پایان این ۱۰ مرحله میتوانید مزرعه جدید دیگری برای خود ایجاد کنید و مراحل را از اول روی مزرعه جدید ادامه دهید با این تفاوت که میتوانید با این کار به میزان مدال های بازی خود اضافه کنید
<br/><br/>

<span class=\"helpTitle\">مدال های بازی</span>
هر مزرعه دار در طول بازی خود میتواند برای خود مدال هایی را جمع آوری کند که هر مدال نشان دهنده ی مهارت مزرعه دار در انجام بازی است
<br/><br/>

<span class=\"helpTitle\">شبکه اجتماعی بازی</span>
یکی از ویژگی های بارز این بازی اجتماعی بودن و توانایی گروهی انجام دادن آن میباشد به این صورت که هر مزرعه دار میتواند برای خود تعدادی دوست انتخاب کند و یا اینکه دوستان خود را دعوت به بازی کند و بدین طریق با هم دیگر و با کمک به مزرعه همدیگر بازی را پیش ببرند بطور مثال \"وقتی که کسی بالا سر مزرعه خودش نباشد و آب گیاهان مزرعش تمام شده باشد دوستانش میتوانند به مزرعش سر بزنند و گیاهانش را آبیاری کنند و یا اینکه به اون مزرعه حمله کنند و اذیتش کنند\" همینطور میتوان با جستجو دیگر کاربران و دیدن صفحه پروفایل آنها با مزرعه داران دیگر آشنا شد و تقاضای دوستی داد و از طریق سیستم پیغام رسان داخلی بازی به ارسال نامه برایشان اقدام نمود
<br/><br/>

<span class=\"helpTitle\">دعوت دوستان</span>
هر مزرعه دار میتواند با واردکردن ایمیل دوست خود و دعوت آن به بازی بعد از ثبت نام دوست مقداری دارایی نقدی برای مزرعه خودش به دست بیاورد
";